Repository: codacy-open-source-projects-scans/man-db
Catalog: man/po4a/po/*.po
Languages: uk

source: Manual pager utils
uk: Утиліти переглядача довідки

source: NAME
uk: ІМʼЯ

source: %apropos% - search the manual page names and descriptions
uk: %apropos% - шукати в назвах та описах сторінок довідки

source: SYNOPSIS
uk: СИНОПСИС

source: B<%apropos%> [\|B<-dalv?V>\|] [\|B<-e>\||\|B<-w>\||\|B<-r>\|] [\|B<-s> I<list>\|] [\|B<-m> I<system>\|[\|,.\|.\|.\|]\|] [\|B<-M> I<path>\|] [\|B<-L> I<locale>\|] [\|B<-C> I<file>\|] I<keyword> \&.\|.\|.
uk: B<%apropos%> [\|B<-dalv?V>\|] [\|B<-e>\||\|B<-w>\||\|B<-r>\|] [\|B<-s> I<список>\|] [\|B<-m> I<система>\|[\|,.\|.\|.\|]\|] [\|B<-M> I<шлях>\|] [\|B<-L> I<локаль>\|] [\|B<-C> I<файл>\|] I<ключове слово> \&.\|.\|.

source: DESCRIPTION
uk: ОПИС

source: Each manual page has a short description available within it. B<%apropos%> searches the descriptions for instances of I<keyword>.
uk: Кожна сторінка довідки має короткий опис, який можна знайти всередині неї. Команда B<%apropos%> шукає в описах входження заданого I<ключового слова>.

source: I<keyword> is usually a regular expression, as if (B<-r>) was used, or may contain wildcards (B<-w>), or match the exact keyword (B<-e>). Using these options, it may be necessary to quote the I<keyword> or escape (\e) the special characters to stop the shell from interpreting them.
uk: I<ключове слово> зазвичай є регулярним виразом, якщо використовується опція (B<-r>), або може містити знаки шаблону (B<-w>), або точно відповідати ключовому слову (B<-e>). Використання цих опцій може вимагати цитування I<ключового слова> або екранування (\e) спеціальних символів, щоб зупинити їх інтерпретацію оболонкою.

source: The standard matching rules allow matches to be made against the page name and word boundaries in the description.
uk: Стандартні правила відповідності дозволяють здійснювати порівняння з імʼям сторінки та межами слів у описі.

source: The database searched by B<%apropos%> is updated by the B<%mandb%> program. Depending on your installation, this may be run by a periodic cron job, or may need to be run manually after new manual pages have been installed.
uk: База даних, яку шукає B<%apropos%>, оновлюється програмою B<%mandb%>. Залежно від вашої установки, це може бути запущено періодичною cron-задачею або потрібно запустити вручну після встановлення нових сторінок довідки.

source: OPTIONS
uk: ПАРАМЕТРИ

source: Print debugging information.
uk: Вивести інформацію для налагодження.

source: Print verbose warning messages.
uk: Вивести деталізовані попереджувальні повідомлення.

source: Interpret each keyword as a regular expression. This is the default behaviour. Each keyword will be matched against the page names and the descriptions independently. It can match any part of either. The match is not limited to word boundaries.
uk: Інтерпретувати кожне ключове слово як регулярний вираз. Це стандартна поведінка. Кожне ключове слово буде збігатися з назвами сторінок та описами незалежно. Воно може збігатися з будь-якою частиною обох. Збіг не обмежується межами слів.

source: Interpret each keyword as a pattern containing shell style wildcards. Each keyword will be matched against the page names and the descriptions independently. If B<--exact> is also used, a match will only be found if an expanded keyword matches an entire description or page name. Otherwise the keyword is also allowed to match on word boundaries in the description.
uk: Інтерпретувати кожне ключове слово як шаблон, що містить маски стилю оболонки. Кожне ключове слово буде порівнюватися з назвами сторінок та описами незалежно. Якщо також використовується B<--exact>, тоді збіг знайдеться лише у випадку, якщо розширене ключове слово відповідає цілій назві сторінки або опису. В іншому випадку дозволено також збігатися на межах слів у описі.

source: Each keyword will be exactly matched against the page names and the descriptions.
uk: Кожне ключове слово буде точно збігатися з назвами сторінок та описами.

source: Only display items that match all the supplied keywords. The default is to display items that match any keyword.
uk: Показувати тільки елементи, які відповідають усім наданим ключовим словам. За замовчуванням показуються елементи, які відповідають будь-якому ключовому слову.

source: Do not trim output to the terminal width. Normally, output will be truncated to the terminal width to avoid ugly results from poorly-written B<NAME> sections.
uk: Не обрізати вивід до ширини терміналу. Зазвичай, вивід буде обрізано до ширини терміналу для уникнення неприємних результатів від погано написаних розділів B<NAME>.

source: B<-s> I<list\/>, B<--sections=>I<list\/>, B<--section=>I<list>
uk: B<-s> I<список\/>, B<--розділи=>I<список\/>, B<--розділ=>I<список>

source: Search only the given manual sections. I<list> is a colon- or comma-separated list of sections. If an entry in I<list> is a simple section, for example "3", then the displayed list of descriptions will include pages in sections "3", "3perl", "3x", and so on; while if an entry in I<list> has an extension, for example "3perl", then the list will only include pages in that exact part of the manual section.
uk: Шукати тільки вказані розділи довідника. I<список> - це список розділів, розділених комами або двокрапками. Якщо запис у I<списку> є простим розділом, наприклад "3", то виведений список описів буде включати сторінки в розділах "3", "3perl", "3x" і т.д.; якщо ж запис у I<списку> має розширення, наприклад "3perl", то список буде включати лише сторінки з точної частини розділу довідника.

source: B<-m> I<system>\|[\|,.\|.\|.\|]\|, B<--systems=>I<system>\|[\|,.\|.\|.\|]
uk: B<-m> I<система>\|[\|,.\|.\|.\|]\|, B<--systems=>I<система>\|[\|,.\|.\|.\|]

source: If this system has access to other operating systems' manual page descriptions, they can be searched using this option. To search NewOS's manual page descriptions, use the option B<-m> B<NewOS>.
uk: Якщо ця система має доступ до описів сторінок керівництва інших операційних систем, то у них можна шукати за допомогою цієї опції. Для пошуку у описах сторінок керівництва NewOS використовуйте опцію B<-m> B<NewOS>.

source: The I<system> specified can be a combination of comma-delimited operating system names. To include a search of the native operating system's B<whatis> descriptions, include the system name B<man> in the argument string. This option will override the $B<SYSTEM> environment variable.
uk: Вказана I<система> може бути комбінацією назв операційних систем розділених комами. Для включення пошуку описів B<whatis> вбудованої операційної системи, додайте назву системи B<man> у рядок аргументів. Ця опція перевизначить змінну середовища $B<SYSTEM>.

source: B<-M\ >I<path>,\ B<--manpath=>I<path>
uk: B<-M\ >I<шлях>,\ B<--manpath=>I<шлях>

source: Specify an alternate set of colon-delimited manual page hierarchies to search. By default, B<%program%> uses the $B<MANPATH> environment variable, unless it is empty or unset, in which case it will determine an appropriate manpath based on your $B<PATH> environment variable. This option overrides the contents of $B<MANPATH>.
uk: Вкажіть альтернативний набір ієрархій сторінок довідки для пошуку, розділених двокрапками. За замовчуванням, B<%program%> використовує змінну середовища $B<MANPATH>, якщо вона не пуста або не встановлена, у цьому випадку програма визначить відповідний manpath на основі вашої змінної середовища $B<PATH>. Ця опція перезаписує вміст $B<MANPATH>.

source: B<-L\ >I<locale>,\ B<--locale=>I<locale>
uk: B<-L\ >I<локаль>,\ B<--locale=>I<локаль>

source: B<%program%> will normally determine your current locale by a call to the C function B<setlocale>(3) which interrogates various environment variables, possibly including $B<LC_MESSAGES> and $B<LANG>. To temporarily override the determined value, use this option to supply a I<locale> string directly to B<%program%>. Note that it will not take effect until the search for pages actually begins. Output such as the help message will always be displayed in the initially determined locale.
uk: Зазвичай програма B<%program%> визначатиме вашу поточний локаль шляхом виклику функції Сі B<setlocale>(3), яка досліджує різні змінні середовища, можливо, включаючи $B<LC_MESSAGES> та $B<LANG>. Щоб тимчасово перекрити визначене значення, скористайтеся цією опцією для безпосереднього надання рядка I<локалі> програмі B<%program%>. Зверніть увагу, що вона не почне діяти до тих пір, поки фактично не почнеться пошук сторінок. Виводи такого типу, як повідомлення про допомогу, завжди будуть показуватися у попередньо визначеній локалі.

source: B<-C\ >I<file>,\ B<--config-file=>I<file>
uk: B<-C\ >I<файл>,\ B<--config-file=>I<файл>

source: Use this user configuration file rather than the default of I<\(ti/.manpath>.
uk: Використовуйте цей користувацький файл конфігурації замість типового у I<\(ti/.manpath)>.

source: Print a help message and exit.
uk: Надрукувати повідомлення довідки та вийти.

source: Print a short usage message and exit.
uk: Надрукувати коротке повідомлення про використання та вийти.

source: Display version information.
uk: Показати інформацію про версію.

source: EXIT STATUS
uk: СТАТУС ВИХОДУ

source: Successful program execution.
uk: Успішне виконання програми.

source: Usage, syntax or configuration file error.
uk: Помилка використання, синтаксису або файлу конфігурації.

source: Operational error.
uk: Операційна помилка.

source: Nothing was found that matched the criteria specified.
uk: Нічого не знайдено, що б відповідало зазначеним критеріям.

source: ENVIRONMENT
uk: СЕРЕДОВИЩЕ

source: If $B<SYSTEM> is set, it will have the same effect as if it had been specified as the argument to the B<-m> option.
uk: Якщо встановлено $B<SYSTEM>, це матиме такий же ефект, як і якби вона була зазначена як аргумент для опції B<-m>.

source: If $B<MANPATH> is set, its value is interpreted as the colon-delimited manual page hierarchy search path to use.
uk: Якщо встановлено змінну $B<MANPATH>, її значення інтерпретується як шлях пошуку ієрархії сторінок довідки, розділений двокрапками.

source: See the B<SEARCH PATH> section of B<manpath>(5) for the default behaviour and details of how this environment variable is handled.
uk: Дивіться розділ B<ШЛЯХ ПОШУКУ> у B<manpath>(5) щодо поведінки за замовчуванням і подробиць того, як обробляється ця змінна середовища.

source: If $B<MANWIDTH> is set, its value is used as the terminal width (see the B<--long> option). If it is not set, the terminal width will be calculated using the value of $B<COLUMNS>, and B<ioctl>(2) if available, or falling back to 80 characters if all else fails.
uk: Якщо встановлено змінну $B<MANWIDTH>, її значення використовується як ширина терміналу (див. опцію B<--long>). Якщо вона не встановлена, ширина терміналу буде розрахована за допомогою значення змінної $B<COLUMNS>, а також за допомогою B<ioctl>(2), якщо він доступний, або, у випадку невдачі, буде використовуватися 80 символів.

source: If $B<POSIXLY_CORRECT> is set, even to a null value, the default B<%apropos%> search will be as an extended regex (B<-r>). Nowadays, this is the default behaviour anyway.
uk: Якщо встановлено $B<POSIXLY_CORRECT>, навіть у значення null, за замовчуванням пошук B<%apropos%> буде виконуватися як розширений регулярний вираз (B<-r>). Сьогодні це є стандартною поведінкою.

source: FILES
uk: ФАЙЛИ

source: A traditional global I<index> database cache.
uk: Традиційний глобальний кеш I<індексу> бази даних.

source: An FHS compliant global I<index> database cache.
uk: Сумісний з FHS глобальний кеш I<індексу> бази даних.

source: A traditional B<whatis> text database.
uk: Традиційна текстова база даних B<whatis>.

source: SEE ALSO
uk: ДИВ. ТАКОЖ

source: AUTHOR
uk: АВТОР

source: BUGS
uk: ПОМИЛКИ

source: lexgrog - parse header information in man pages
uk: lexgrog - аналізувати інформацію заголовку в сторінках довідки

source: B<lexgrog> [\|B<-m>\||\|B<-c>\|] [\|B<-dfw?V>\|] [\|B<-E> I<encoding>\|] I<file> \&.\|.\|.
uk: B<lexgrog> [\|B<-m>\||\|B<-c>\|] [\|B<-dfw?V>\|] [\|B<-E> I<кодування>\|] I<файл> \&.\|.\|.

source: B<lexgrog> is an implementation of the traditional \(lqgroff guess\(rq utility in B<lex>. It reads the list of files on its command line as either man page source files or preformatted \(lqcat\(rq pages, and displays their name and description as used by B<apropos> and B<whatis>, the list of preprocessing filters required by the man page before it is passed to B<nroff> or B<troff>, or both.
uk: B<lexgrog> - це реалізація традиційної утиліти «groff guess» в B<lex>. Вона читає список файлів, переданих їй як аргументи командного рядка, як джерело сторінок man або вже відформатовані «cat» сторінки, і показує їх назву та опис, використовуючи B<apropos> та B<whatis>, список попередніх фільтрів, необхідних для сторінки man перед тим, як вона буде передана до B<nroff> або B<troff>, або обох.

source: If its input is badly formatted, B<lexgrog> will print \(lqparse failed\(rq; this may be useful for external programs that need to check man pages for correctness. If one of B<lexgrog>'s input files is \(lq-\(rq, it will read from standard input; if any input file is compressed, a decompressed version will be read automatically.
uk: Якщо його вхідні дані погано сформовані, B<lexgrog> над «parse failed». Це може бути корисним для зовнішніх програм, які повинні перевіряти сторінки man на правильність. Якщо один з вхідних файлів B<lexgrog> є «-», він прочитає дані зі стандартного вводу; якщо будь-який вхідний файл стиснутий, буде автоматично прочитана розпакована версія.

source: Parse input as man page source files. This is the default if neither B<--man> nor B<--cat> is given.
uk: Аналізувати вхідні дані як джерело сторінок man. Це значення за замовчуванням, якщо не вказано ні B<--man>, ні B<--cat>.

source: Parse input as preformatted man pages (\(lqcat pages\(rq). B<--man> and B<--cat> may not be given simultaneously.
uk: Аналізувати вхідні дані як форматовані сторінки довідки («сторінки cat»). B<--man> та B<--cat> не можуть бути задані одночасно.

source: Display the name and description from the man page's header, as used by B<apropos> and B<whatis>. This is the default if neither B<--whatis> nor B<--filters> is given.
uk: Показати назву та опис із заголовка сторінки man, як використовується у B<apropos> і B<whatis>. Це значення за замовчуванням, якщо не вказано ні B<--whatis>, ні B<--filters>.

source: Display the list of filters needed to preprocess the man page before formatting with B<nroff> or B<troff>.
uk: Показати список фільтрів, необхідних для попередньої обробки сторінки man перед форматуванням за допомогою B<nroff> або B<troff>.

source: B<-E> I<encoding>, B<--encoding> I<encoding>
uk: B<-E> I<кодування>, B<--encoding> I<кодування>

source: Override the guessed character set for the page to I<encoding>.
uk: Перевизначити вгадану кодову сторінку для сторінки на I<кодування>.

source: Usage error.
uk: Помилка використання.

source: B<lexgrog> failed to parse one or more of its input files.
uk: B<lexgrog> не вдалося розібрати один або кілька своїх вхідних файлів.

source: EXAMPLES
uk: ПРИКЛАДИ

source: $ lexgrog man.1 man.1: "man - an interface to the system reference manuals" $ lexgrog -fw man.1 man.1 (t): "man - an interface to the system reference manuals" $ lexgrog -c whatis.cat1 whatis.cat1: "whatis - display manual page descriptions" $ lexgrog broken.1 broken.1: parse failed
uk: $ lexgrog man.1 man.1: "man - інтерфейс до системних довідкових керівництв" $ lexgrog -fw man.1 man.1 (t): "man - інтерфейс до системних довідкових керівництв" $ lexgrog -c whatis.cat1 whatis.cat1: "whatis - показувати описи сторінок довідки" $ lexgrog broken.1 broken.1: синтаксичний аналіз не вдався

source: WHATIS PARSING
uk: РОЗБІР WHATIS

source: B<%mandb%> (which uses the same code as B<lexgrog>) parses the B<NAME> section at the top of each manual page looking for names and descriptions of the features documented in each. While the parser is quite tolerant, as it has to cope with a number of different forms that have historically been used, it may sometimes fail to extract the required information.
uk: B<%mandb%> (яка використовує той самий код, що і B<lexgrog>) аналізує розділ B<NAME> у верхній частині кожної сторінки довідника, шукаючи назви та описи функцій, які документуються в кожному. Хоча аналізатор досить толерантний, оскільки він має впоратися з багатьма різними формами, що історично використовувалися, йому іноді може не вдаватися видобути необхідну інформацію.

source: When using the traditional I<man> macro set, a correct B<NAME> section looks something like this:
uk: При використанні традиційного набору макросів I<man>, правильний розділ B<NAME> виглядає приблизно так:

source: \&.SH NAME foo \e- program to do something
uk: \&.SH NAME foo \e- програма для виконання певних дій

source: Some manual pagers require the \(oq\e-\(cq to be exactly as shown; B<%mandb%> is more tolerant, but for compatibility with other systems it is nevertheless a good idea to retain the backslash.
uk: Деякі гортачі довідки вимагають, щоб \(oq\e-\(cq було показано точно так само; B<%mandb%> більш терпимий, але для сумісності з іншими системами все ж бажано зберігати зворотній слеш.

source: On the left-hand side, there may be several names, separated by commas. Names containing whitespace will be ignored to avoid pathological behaviour on certain ill-formed B<NAME> sections. The text on the right-hand side is free-form, and may be spread over multiple lines. If several features with different descriptions are being documented in the same manual page, the following form is therefore used:
uk: Зліва можуть бути вказано кілька імен, розділених комами. Імена, що містять пробіли, будуть ігноруватися, щоб уникнути патологічної поведінки в певних неправильно сформованих секціях B<NAME>. Текст праворуч є довільним та може розподілятися на кілька рядків. Якщо в одній сторінці керівництва описується кілька функцій з різними описами, то використовується наступна форма:

source: \&.SH NAME foo, bar \e- programs to do something \&.br baz \e- program to do nothing
uk: \&.SH NAME foo, bar \e- програми для виконання певних дій \&.br baz \e- програма, яка нічого не робить

source: (A macro which starts a new paragraph, like B<.PP>, may be used instead of the break macro B<.br>.)
uk: (Макрос, який починає новий абзац, на кшталт B<.PP>, може бути використаний замість макросу перенесення рядка B<.br>.)

source: When using the BSD-derived I<mdoc> macro set, a correct B<NAME> section looks something like this:
uk: При використанні набору макросів I<mdoc>, похідних від BSD, правильний розділ B<NAME> виглядає приблизно так:

source: \&.Sh NAME \&.Nm foo \&.Nd program to do something
uk: \&.Sh NAME \&.Nm foo \&.Nd програма для виконання певних дій

source: There are several common reasons why whatis parsing fails. Sometimes authors of manual pages replace \(oq.SH NAME\(cq with \(oq.SH MYPROGRAM\(cq, and then B<%mandb%> cannot find the section from which to extract the information it needs. Sometimes authors include a NAME section, but place free-form text there rather than \(oqname \e- description\(cq. However, any syntax resembling the above should be accepted.
uk: Існує кілька поширених причин, чому аналіз whatis не вдається. Іноді автори сторінок довідки замінюють \(oq.SH NAME\(cq на \(oq.SH MYPROGRAM\(cq, і тоді B<%mandb%> не може знайти розділ, з якого потрібно витягнути необхідну інформацію. Іноді автори включають розділ B<NAME>, але розміщують там вільний текст замість \(oqname \e- опису\(cq. Проте, будь-яка синтаксична конструкція, що нагадує вищезазначене, повинна бути прийнятною.

source: NOTES
uk: ПРИМІТКИ

source: B<lexgrog> attempts to parse files containing .so requests, but will only be able to do so correctly if the files are properly installed in a manual page hierarchy.
uk: B<lexgrog> намагається аналізувати файли, які містять запити .so, але зможе це робити правильно тільки тоді, коли ці файли будуть правильно встановлені у ієрархії сторінок довідки.

source: The code used by B<lexgrog> to scan man pages was written by:
uk: Код, який використовується B<lexgrog> для сканування сторінок man, написаний:

source: Colin Watson wrote the current incarnation of the command-line front-end, as well as this man page.
uk: Колін Вотсон написав поточну версію інтерфейсу командного рядка, а також цю сторінку довідки.

source: %man% - an interface to the system reference manuals
uk: %man% - інтерфейс до довідкових матеріалів системи

source: B<%man%> [\|I<man options>\|] [\|[\|I<section>\|] I<page>\ \|.\|.\|.\|]\ .\|.\|.\&
uk: B<%man%> [\|I<параметри man>\|] [\|[\|I<розділ>\|] I<сторінка>\ \|.\|.\|.\|]\ .\|.\|.\&

source: B<%man%> B<-k> [\|I<apropos options>\|] I<regexp> \&.\|.\|.\&
uk: B<%man%> B<-k> [\|I<параметри apropos>\|] I<регулярний вираз> \&.\|.\|.\&

source: B<%man%> B<-K> [\|I<man options>\|] [\|I<section>\|] I<term>\ .\|.\|.\&
uk: B<%man%> B<-K> [\|I<параметри man>\|] [\|I<розділ>\|] I<термін>\ .\|.\|.\&

source: B<%man%> B<-f> [\|I<whatis> I<options>\|] I<page> \&.\|.\|.\&
uk: B<%man%> B<-f> [\|I<whatis> I<параметри>\|] I<сторінка> \&.\|.\|.\&

source: B<%man%> B<-l> [\|I<man options>\|] I<file> \&.\|.\|.\&
uk: B<%man%> B<-l> [\|I<параметри man>\|] I<файл> \&.\|.\|.\&

source: B<%man%> B<-w>\||\|B<-W> [\|I<man options>\|] I<page> \&.\|.\|.\&
uk: B<%man%> B<-w>\||\|B<-W> [\|I<параметри man>\|] I<сторінка> \&.\|.\|.\&

source: B<%man%> is the system's manual pager. Each I<page> argument given to B<%man%> is normally the name of a program, utility or function. The I<manual page> associated with each of these arguments is then found and displayed. A I<section>, if provided, will direct B<%man%> to look only in that I<section> of the manual. The default action is to search in all of the available I<sections> following a pre-defined order (see B<DEFAULTS>), and to show only the first I<page> found, even if I<page> exists in several I<sections>.
uk: B<%man%> - це гортач системних сторінок довідки. Кожний аргумент I<сторінка>, наданий B<%man%>, зазвичай є іменем програми, утиліти або функції. Потім знаходиться та показується I<сторінка довідки>, повʼязана з кожним з цих аргументів. Якщо вказано I<розділ>, B<%man%> буде шукати тільки у цьому I<розділі> довідки. За замовчуванням програма шукає у всіх доступних I<розділах> за певним попередньо визначеним порядком (дивіться B<ЗА ЗАМОВЧУВАННЯМ>) та показує лише першу знайдену I<сторінку>, навіть якщо I<сторінка> існує у декількох I<розділах>.

source: The table below shows the I<section> numbers of the manual followed by the types of pages they contain.
uk: У таблиці нижче наведено номери розділів довідника, за якими слідують типи сторінок, які вони містять.

source: Executable programs or shell commands
uk: Виконувані програми або команди оболонки

source: System calls (functions provided by the kernel)
uk: Системні виклики (функції, надані ядром)

source: Library calls (functions within program libraries)
uk: Виклики бібліотек (функції всередині програмних бібліотек)

source: Special files (usually found in I</dev\/>)
uk: Спеціальні файли (зазвичай знаходяться в /dev/)

source: File formats and conventions, e.g.\& I</etc/passwd>
uk: Формати файлів та узгодження, напр. \& I</etc/passwd>

source: Games
uk: Ігри

source: Miscellaneous (including macro packages and conventions), e.g.\& B<man>(7), B<groff>(7), B<man-pages>(7)
uk: Різне (включно з макропакетами та узгодженнями), напр.\& B<man>(7), B<groff>(7), B<man-pages>(7)

source: System administration commands (usually only for root)
uk: Команди системного адміністрування (зазвичай лише для root)

source: Kernel routines [\|Non standard\|]
uk: Процедури ядра [\|Не стандартні\|]

source: A manual I<page> consists of several sections.
uk: I<Сторінка> довідника складається з декількох розділів.
