Repository: codacy-open-source-projects-scans/man-db
Catalog: man/po4a/po/*.po
Languages: uk

source: Conventional section names include B<NAME>, B<SYNOPSIS>, B<CONFIGURATION>, B<DESCRIPTION>, B<OPTIONS>, B<EXIT\ STATUS>, B<RETURN\ VALUE>, B<ERRORS>, B<ENVIRONMENT>, B<FILES>, B<VERSIONS>, B<STANDARDS>, B<NOTES>, B<BUGS>, B<EXAMPLE>, B<AUTHORS>, and B<SEE\ ALSO>.
uk: Типові назви розділів включають B<NAME>, B<SYNOPSIS>, B<CONFIGURATION>, B<DESCRIPTION>, B<OPTIONS>, B<EXIT\ STATUS>, B<RETURN\ VALUE>, B<ERRORS>, B<ENVIRONMENT>, B<FILES>, B<VERSIONS>, B<STANDARDS>, B<NOTES>, B<BUGS>, B<EXAMPLE>, B<AUTHORS>, і B<SEE\ ALSO>.

source: The following conventions apply to the B<SYNOPSIS> section and can be used as a guide in other sections.
uk: Наступні правила застосовуються до розділу B<СИНОПСИС> та можуть бути використані як посібник у інших розділах.

source: B<bold text>
uk: B<жирний текст>

source: type exactly as shown.
uk: введіть точно так, як показано.

source: I<italic text>
uk: I<текст курсивом>

source: replace with appropriate argument.
uk: замініть відповідним аргументом.

source: any or all arguments within [ ] are optional.
uk: будь-які або всі аргументи всередині [ ] є необовʼязковими.

source: options delimited by | cannot be used together.
uk: опції, розділені символом '|', не можуть використовуватися разом.

source: I<argument> .\|.\|.
uk: I<аргумент> .\|.\|.

source: I<argument> is repeatable.
uk: I<аргумент> можна повторювати.

source: [\|I<expression>\|] .\|.\|.
uk: [\|I<вираз>\|] .\|.\|.

source: entire I<expression>\ within [ ] is repeatable.
uk: весь вираз I<expression>\ всередині [ ] може повторюватися.

source: Exact rendering may vary depending on the output device. For instance, man will usually not be able to render italics when running in a terminal, and will typically use underlined or coloured text instead.
uk: Точність відображення може відрізнятися залежно від кінцевого пристрою. Наприклад, команда man зазвичай не зможе показати курсив у терміналі та часто використовує підкреслений або кольоровий текст замість цього.

source: The command or function illustration is a pattern that should match all possible invocations. In some cases it is advisable to illustrate several exclusive invocations as is shown in the B<SYNOPSIS> section of this manual page.
uk: Ілюстрація команди або функції є шаблоном, який повинен відповідати всім можливим викликам. У деяких випадках бажано ілюструвати кілька виключних викликів, як це показано у розділі B<СИНОПСИС> цієї сторінки довідника.

source: Display the manual page for the I<item> (program) I<ls>.
uk: Показати сторінку довідки для I<елементу> (програми) I<ls>.

source: Display the manual page for macro package I<man> from section I<7>. (This is an alternative spelling of "B<%man%> I<7 man>".)
uk: Показати сторінку довідки для макропакету I<man> з розділу I<7>. (Це альтернативне написання «B<%man%> I<7 man>».)

source: Display the manual page for macro package I<man> from section I<7>. (This is another alternative spelling of "B<%man%> I<7 man>". It may be more convenient when copying and pasting cross-references to manual pages. Note that the parentheses must normally be quoted to protect them from the shell.)
uk: Показати сторінку довідки для макропакету I<man> з розділу I<7>. (Це інший варіант написання "B<%man%> I<7 man>". Це може бути зручніше при копіюванні та вставці посилань на сторінки довідки. Зверніть увагу, що дужки зазвичай повинні бути в лапках, щоб захистити їх від оболонки.)

source: Display, in succession, all of the available I<intro> manual pages contained within the manual. It is possible to quit between successive displays or skip any of them.
uk: Послідовно показувати всі доступні сторінки керівництва I<intro>. Можна вийти між показами або пропустити будь-який з них.

source: Format the manual page for I<bash> into the default B<troff> or B<groff> format and pipe it to the printer named I<ps>. The default output for B<groff> is usually PostScript. B<%man% --help> should advise as to which processor is bound to the B<-t> option.
uk: Сформувати сторінку довідки для I<bash> у форматі за замовчуванням B<troff> або B<groff> та передати її принтеру з назвою I<ps>. За замовчуванням вихідні дані для B<groff> - це зазвичай PostScript. B<%man% --help> повинно порадити, який процесор повʼязаний з опцією B<-t>.

source: This command will decompress and format the nroff source manual page I<./foo.1x.gz> into a B<device independent (dvi)> file. The redirection is necessary as the B<-T> flag causes output to be directed to B<stdout> with no pager. The output could be viewed with a program such as B<xdvi> or further processed into PostScript using a program such as B<dvips>.
uk: Ця команда розпакує та сформує джерело сторінки керівництва nroff I<./foo.1x.gz> у файл B<незалежний від пристрою (dvi)> файл. Перенаправлення необхідне, оскільки прапорець B<-T> призводить до виведення результату в B<stdout> без використання гортача. Результат можна переглянути за допомогою програми, такої як B<xdvi>, або далі обробити у PostScript за допомогою програми, такої як B<dvips>.

source: Search the short descriptions and manual page names for the keyword I<printf> as regular expression. Print out any matches. Equivalent to B<%apropos%>I<\ printf>B<.>
uk: Шукає короткі описи та назви сторінок довідки за ключовим словом I<printf>, використовуючи його як регулярний вираз. Надрукує будь-які збіги. Еквівалентно B<%apropos%>I<\ printf>B<.>

source: Lookup the manual pages referenced by I<smail> and print out the short descriptions of any found. Equivalent to B<%whatis%>I<\ smail>B<.>
uk: Знайти сторінки довідника, на які посилається I<smail>, і надрукувати короткі описи знайдених. Еквівалентно B<%whatis%>I<\ smail>B<.>

source: OVERVIEW
uk: ОГЛЯД

source: Many options are available to B<%man%> in order to give as much flexibility as possible to the user. Changes can be made to the search path, section order, output processor, and other behaviours and operations detailed below.
uk: Доступно багато опцій для B<%man%>, щоб надати користувачеві максимальну гнучкість. Можна змінювати шлях пошуку, порядок розділів, обробник виводу та інші операції та поведінки, про які детальніше описано нижче.

source: If set, various environment variables are interrogated to determine the operation of B<%man%>. It is possible to set the "catch-all" variable $B<MANOPT> to any string in command line format, with the exception that any spaces used as part of an option's argument must be escaped (preceded by a backslash). B<%man%> will parse $B<MANOPT> prior to parsing its own command line. Those options requiring an argument will be overridden by the same options found on the command line. To reset all of the options set in $B<MANOPT>, B<-D> can be specified as the initial command line option. This will allow %man% to "forget" about the options specified in $B<MANOPT>, although they must still have been valid.
uk: Якщо встановлено, перевіряються різні змінні середовища для визначення роботи B<%man>. Можливо встановити "загальну" змінну $B<MANOPT> до будь-якого рядка у форматі командного рядка, за винятком того, що пробіли, використовувані як частина аргументу опції, повинні бути екрановані (зворотньою похилою рискою). B<%man%> розбере $B<MANOPT> перед тим, як розбирати власний командний рядок. Опції, що вимагають аргументів, будуть перезаписані такими ж опціями, знайденими у командному рядку. Для скидання всіх опцій, встановлених у $B<MANOPT>, B<-D> можна вказати як першу опцію командного рядка. Це дозволить %man% «забути» про опції, зазначені у $B<MANOPT>, хоча вони все ще повинні були бути дійсними.

source: Manual pages are normally stored in B<nroff>(1) format under a directory such as I</usr/share/man>. In some installations, there may also be preformatted I<cat pages> to improve performance. See B<manpath>(5) for details of where these files are stored.
uk: Сторінки довідки зазвичай зберігаються у форматі B<nroff>(1) в каталозі, такі як I</usr/share/man>. У деяких інсталяціях також можуть бути попередньо відформатовані I<сторінки cat>, щоб покращити продуктивність. Дізнайтеся більше у B<manpath>(5) про подробиці того, де зберігаються ці файли.

source: This package supports manual pages in multiple languages, controlled by your I<locale>. If your system did not set this up for you automatically, then you may need to set $B<LC_MESSAGES>, $B<LANG>, or another system-dependent environment variable to indicate your preferred locale, usually specified in the B<POSIX> format:
uk: Цей пакет підтримує сторінки довідки на декількох мовах, керовані вашою I<локаллю>. Якщо ваша система не встановила це для вас автоматично, тоді вам може знадобитися встановити змінну середовища $B<LC_MESSAGES>, $B<LANG> або іншу системно-залежну змінну середовища для позначення вашої бажаної локалі, зазвичай вказаної у форматі B<POSIX>:

source: E<lt>I<language>E<gt>[\|B<_>E<lt>I<territory>E<gt>\|[\|B<.>E<lt>I<character-set>E<gt>\|[\|B<,>E<lt>I<version>E<gt>\|]\|]\|]
uk: E<lt>I<мова>E<gt>[\|B<_>E<lt>I<територія>E<gt>\|[\|B<.>E<lt>I<кодування>E<gt>\|[\|B<,>E<lt>I<версія>E<gt>\|]\|]\|]

source: If the desired page is available in your I<locale>, it will be displayed in lieu of the standard (usually American English) page.
uk: Якщо бажана сторінка доступна вашою мовою у ваші I<локалі>, вона буде показана замість стандартної сторінки (зазвичай англійської).

source: If you find that the translations supplied with this package are not available in your native language and you would like to supply them, please contact the maintainer who will be coordinating such activity.
uk: Якщо ви знайдете, що переклади, що постачаються з цим пакетом, недоступні вашою рідною мовою але ви хотіли б їх надати нам, будь ласка, звʼяжіться з відповідальним за таку діяльність.

source: Individual manual pages are normally written and maintained by the maintainers of the program, function, or other topic that they document, and are not included with this package. If you find that a manual page is missing or inadequate, please report that to the maintainers of the package in question.
uk: Індивідуальні сторінки довідки зазвичай пишуть і підтримують ті, хто відповідає за програму, функцію або іншу тему, яку вони документують, і не включені до цього пакета. Якщо ви знайдете, що сторінка довідки відсутня або недостатньо повна, будь ласка, повідомте про це розробників відповідного пакета.

source: For information regarding other features and extensions available with this manual pager, please read the documents supplied with the package.
uk: Для отримання інформації про інші функції та розширення, доступні з цим гортачем посібників, будь ласка, прочитайте документи, що постачаються з пакетом.

source: DEFAULTS
uk: ЗА ЗАМОВЧУВАННЯМ

source: The order of sections to search may be overridden by the environment variable $B<MANSECT> or by the B<SECTION> directive in I<%manpath_config_file%>. By default it is as follows:
uk: Порядок розділів для пошуку може бути перевизначений змінною середовища $B<MANSECT> або директивою B<SECTION> у файлі конфігурації I<%manpath_config_file%>. За замовчуванням це виглядає так:

source: The formatted manual page is displayed using a I<pager>. This can be specified in a number of ways, or else will fall back to a default (see option B<-P> for details).
uk: Форматована сторінка довідки показується за допомогою I<гортача> (pager). Це можна вказати різними способами, або ж буде використовуватися значення за замовчуванням (дивіться подробиці для опції B<-P> ).

source: The filters are deciphered by a number of means. Firstly, the command line option B<-p> or the environment variable $B<MANROFFSEQ> is interrogated. If B<-p> was not used and the environment variable was not set, the initial line of the nroff file is parsed for a preprocessor string. To contain a valid preprocessor string, the first line must resemble
uk: Фільтри розшифровуються різними способами. По-перше, перевіряється опція командного рядка B<-p> або змінна середовища $B<MANROFFSEQ>. Якщо B<-p> не використовувалася і змінна середовища не встановлена, перший рядок файлу nroff аналізується на наявність рядка препроцесора. Для того, щоб містити дійсний рядок препроцесора, перший рядок повинен бути схожим

source: B<'\e"> E<lt>B<string>E<gt>
uk: B<'\е"> E<lt>B<рядок>E<gt>

source: where B<string> can be any combination of letters described by option B<-p> below.
uk: де B<рядок> може бути будь-якою комбінацією літер, описаних опцією B<-p> нижче.

source: If none of the above methods provide any filter information, a default set is used.
uk: Якщо жоден з вищезгаданих методів не надає інформації про фільтр, використовується набір за замовчуванням.

source: A formatting pipeline is formed from the filters and the primary formatter (B<nroff> or [B<tg>]B<roff> with B<-t>) and executed. Alternatively, if an executable program I<mandb_nfmt> (or I<mandb_tfmt> with B<-t>) exists in the man tree root, it is executed instead. It gets passed the manual source file, the preprocessor string, and optionally the device specified with B<-T> or B<-E> as arguments.
uk: Створюється конвеєр форматування з фільтрів та основного форматувальника (B<nroff> або [B<tg>]B<roff> з B<-t>) і виконується. Або, якщо в корені дерева man існує виконуваний програмний файл I<mandb_nfmt> (або I<mandb_tfmt> з B<-t>), то замість цього виконується він. Він отримує файл джерела документації, рядок препроцесора та необовʼязково пристрій, вказаний з B<-T> або B<-E>, як аргументи.

source: Non-argument options that are duplicated either on the command line, in $B<MANOPT>, or both, are not harmful. For options that require an argument, each duplication will override the previous argument value.
uk: Опції без аргумента, які дублюються або в командному рядку, або в $B<MANOPT>, не завдають шкоди. Для опцій, що вимагають аргумента, кожне повторення перезаписує попереднє значення аргумента.

source: General options
uk: Загальні параметри

source: This option is normally issued as the very first option and resets B<%man%'s> behaviour to its default. Its use is to reset those options that may have been set in $B<MANOPT>. Any options that follow B<-D> will have their usual effect.
uk: Ця опція зазвичай видається як перша і скидає поведінку B<%man%> до її стандартних налаштувань. Її використання полягає в тому, щоб скинути ті опції, які могли бути встановлені в $B<MANOPT>. Будь-які опції, які йдуть після B<-D>, збережуть свою звичайну дію.

source: B<--warnings>[=I<warnings\/>]
uk: B<--warnings>[=I<попередження\/>]

source: Enable warnings from I<groff>. This may be used to perform sanity checks on the source text of manual pages. I<warnings> is a comma-separated list of warning names; if it is not supplied, the default is "mac". To disable a I<groff> warning, prefix it with "!": for example, B<--warnings=mac,!break> enables warnings in the "mac" category and disables warnings in the "break" category. See the \(lqWarnings\(rq node in B<info groff> for a list of available warning names.
uk: Увімкнути попередження від I<groff>. Це може використовуватися для перевірки коректності тексту джерела сторінок довідки. I<попередження> - це список імен попереджень, розділених комами; якщо він не вказаний, за замовчуванням використовується "mac". Щоб вимкнути попередження I<groff>, попереду його назви потрібно поставити "!": наприклад, B<--warnings=mac,!break> увімкне попередження в категорії "mac" і вимкне попередження в категорії "break". Для перегляду списку доступних імен попереджень див. розділ «Попередження» у B<info groff>.

source: Main modes of operation
uk: Основні режими роботи

source: Approximately equivalent to B<%whatis%>. Display a short description from the manual page, if available. See B<%whatis%>(1) for details.
uk: Приблизно еквівалентно B<%whatis%>. Виводить короткий опис з сторінки довідки, якщо він доступний. Подробиці у B<%whatis%>(1).

source: Approximately equivalent to B<%apropos%>. Search the short manual page descriptions for keywords and display any matches. See B<%apropos%>(1) for details.
uk: Приблизно еквівалентно команді B<%apropos%>. Пошук коротких описів сторінок довідки за ключовими словами та показ будь-яких збігів. Дивіться подробиці у B<%apropos%>(1).

source: Search for text in all manual pages. This is a brute-force search, and is likely to take some time; if you can, you should specify a section to reduce the number of pages that need to be searched. Search terms may be simple strings (the default), or regular expressions if the B<--regex> option is used.
uk: Пошук тексту у всіх сторінках довідки. Це метод грубої сили, і це може зайняти деякий час; якщо можливо, ви повинні вказати розділ, щоб зменшити кількість сторінок, які необхідно переглядати. Пошукові терміни можуть бути простими рядками (за замовчуванням), або регулярними виразами, якщо використовується опція B<--regex>.

source: Note that this searches the I<sources> of the manual pages, not the rendered text, and so may include false positives due to things like comments in source files, or false negatives due to things like hyphens being written as "\e-" in source files. Searching the rendered text would be much slower.
uk: Зверніть увагу, що цей пошук виконується в джерелах сторінок довідки, а не у відформатованому тексті, тому може включати хибні позитивні результати через такі речі, як коментарі в файлах джерел, або хибні негативні результати через такі речі, як тире, записані як "\e-" у файлах джерел. Пошук відформатованого тексту був би набагато повільнішим.

source: Activate "local" mode. Format and display local manual files instead of searching through the system's manual collection. Each manual page argument will be interpreted as an nroff source file in the correct format. No cat file is produced. If '-' is listed as one of the arguments, input will be taken from stdin.
uk: Активувати «локальний» режим. Форматувати та показувати локальні файли довідки замість пошуку у колекції системної довідки. Кожен аргумент сторінки довідки буде інтерпретований як джерело nroff у правильному форматі. Не створюється файл cat. Якщо '-' вказано одним з аргументів, вхідні дані будуть братися зі stdin.

source: If this option is not used, then B<%man%> will also fall back to interpreting manual page arguments as local file names if the argument contains a "/" character, since that is a good indication that the argument refers to a path on the file system.
uk: Якщо цей параметр не використовується, тоді B<%man%> також буде вважати аргументи сторінок довідки локальними іменами файлів, якщо аргумент містить символ "/", оскільки це є хорошим індикатором того, що аргумент посилається на шлях у файловій системі.

source: Don't actually display the manual page, but do print the location of the source nroff file that would be formatted. If the B<-a> option is also used, then print the locations of all source files that match the search criteria.
uk: Не показувати сторінку довідки, а лише надрукувати розташування вихідного файлу nroff, який би був сформований. Якщо також використовується опція B<-a>, тоді надрукувати розташування всіх вихідних файлів, які відповідають критеріям пошуку.

source: Don't actually display the manual page, but do print the location of the preformatted cat file that would be displayed. If the B<-a> option is also used, then print the locations of all preformatted cat files that match the search criteria.
uk: Не показувати сторінку довідки, а лише надрукувати розташування файлу категорії, який би був показаний. Якщо також використовується опція B<-a>, тоді надрукувати розташування всіх відформатованих файлів категорій, які відповідають критеріям пошуку.

source: If B<-w> and B<-W> are both used, then print both source file and cat file separated by a space. If all of B<-w>, B<-W>, and B<-a> are used, then do this for each possible match.
uk: Якщо використовуються обидва параметри B<-w> та B<-W>, то друкувати як джерело файлу, так і файл каталогу, розділені пробілом. Якщо використовуються всі три параметри B<-w>, B<-W>, та B<-a>, то робити це для кожного можливого збігу.

source: This option is not for general use and should only be used by the B<%catman%> program.
uk: Ця опція не призначена для загального використання і повинна використовуватися лише програмою B<%catman%>.

source: B<-R\ >I<encoding>,\ B<--recode>=I<encoding>
uk: B<-R\ >I<кодування>, \ B<--recode>=I<кодування>

source: Instead of formatting the manual page in the usual way, output its source converted to the specified I<encoding>. If you already know the encoding of the source file, you can also use B<%manconv%>(1) directly. However, this option allows you to convert several manual pages to a single encoding without having to explicitly state the encoding of each, provided that they were already installed in a structure similar to a manual page hierarchy.
uk: Замість того, щоб форматувати сторінку довідки за звичайним способом, виведе її джерело, перекодоване у вказане I<кодування>. Якщо ви вже знаєте кодування файлу джерела, ви також можете використовувати B<%manconv%>(1) безпосередньо. Однак ця опція дозволяє перекодувати кілька сторінок довідки у одне кодування без необхідності явно вказати кодування кожного, при умові, що вони були вже встановлені в структурі, схожій на ієрархію сторінок довідки.

source: Consider using B<%man_recode%>(1) instead for converting multiple manual pages, since it has an interface designed for bulk conversion and so can be much faster.
uk: Розгляньте використання B<%man_recode%>(1) для перекодування декількох сторінок довідки, оскільки воно має інтерфейс, розрахований на масове перекодування, і тому може бути значно швидшим.

source: Finding manual pages
uk: Пошук сторінок довідки

source: If this system has access to other operating systems' manual pages, they can be accessed using this option. To search for a manual page from NewOS's manual page collection, use the option B<-m> B<NewOS>.
uk: Якщо ця система має доступ до сторінок довідки інших операційних систем, вони можуть бути доступні за допомогою цієї опції. Для пошуку сторінки довідки з колекції сторінок довідки NewOS використовуйте опцію B<-m> B<NewOS>.

source: The I<system> specified can be a combination of comma delimited operating system names. To include a search of the native operating system's manual pages, include the system name B<man> in the argument string. This option will override the $B<SYSTEM> environment variable.
uk: Вказана I<система> може бути комбінацією операційних систем, перелічених через кому. Для включення пошуку в керівництвах власної операційної системи, включіть імʼя системної команди B<man> у рядок аргументів. Ця опція перевизначить змінну середовища $B<SYSTEM>.

source: Specify an alternate manpath to use. By default, B<%man%> uses B<%manpath%> derived code to determine the path to search. This option overrides the $B<MANPATH> environment variable and causes option B<-m> to be ignored.
uk: Вкажіть альтернативний manpath для використання. За замовчуванням, B<%man%> використовує код, похідний від B<%manpath%>, щоб визначити шлях для пошуку. Ця опція перевизначає змінну середовища $B<MANPATH> і призводить до того, що опція B<-m> буде проігнорована.

source: A path specified as a manpath must be the root of a manual page hierarchy structured into sections as described in the man-db manual (under "The manual page system"). To view manual pages outside such hierarchies, see the B<-l> option.
uk: Шлях, вказаний як manpath, повинен бути коренем ієрархії сторінок довідки, структурованої у розділи, як описано в керівництві man-db (під розділом «Система сторінок довідки»). Щоб переглянути сторінки довідки поза такими ієрархіями, дивіться опцію B<-l>.

source: B<-S> I<list\/>, B<-s> I<list\/>, B<--sections=>I<list\/>
uk: B<-S> I<список\/>, B<-s> I<список\/>, B<--sections=>I<список\/>
