Repository: codacy-open-source-projects-scans/man-db
Catalog: man/po4a/po/*.po
Languages: uk

source: If $B<BROWSER> is set, its value is a colon-delimited list of commands, each of which in turn is used to try to start a web browser for B<man> B<--html>. In each command, I<%s> is replaced by a filename containing the HTML output from B<groff>, I<%%> is replaced by a single percent sign (%), and I<%c> is replaced by a colon (:).
uk: Якщо встановлено змінну $B<BROWSER>, її значення є списком команд, розділених двокрапками. Кожна з цих команд використовується для спроби запустити веб-переглядач для B<man> B<--html>. У кожній команді I<%s> замінюється на імʼя файлу, що містить HTML вивід з B<groff>, I<%%> замінюється на одинарний знак відсотка (%), а I<%c> - на двокрапку (:).

source: If $B<MANOPT> is set, it will be parsed prior to B<%man%'s> command line and is expected to be in a similar format. As all of the other B<%man%> specific environment variables can be expressed as command line options, and are thus candidates for being included in $B<MANOPT> it is expected that they will become obsolete. N.B. All spaces that should be interpreted as part of an option's argument must be escaped.
uk: Якщо встановлено змінну середовища $B<MANOPT>, вона буде оброблена перед командним рядком B<%man%> і очікується, що матиме схожий формат. Оскільки всі інші специфічні для B<%man%> змінні середовища можуть бути виражені як параметри командного рядка, і тому є кандидатами на включення до $B<MANOPT>, очікується, що вони стануть застарілими. Зверніть увагу, що всі пробіли, які повинні бути інтерпретовані як частина аргументу параметра, повинні бути екрановані.

source: If $B<MANWIDTH> is set, its value is used as the line length for which manual pages should be formatted. If it is not set, manual pages will be formatted with a line length appropriate to the current terminal (using the value of $B<COLUMNS>, and B<ioctl>(2) if available, or falling back to 80 characters if neither is available). Cat pages will only be saved when the default formatting can be used, that is when the terminal line length is between 66 and 80 characters.
uk: Якщо встановлено $B<MANWIDTH>, його значення використовується як довжина рядка для форматування сторінок довідки. Якщо воно не встановлено, сторінки довідки будуть відформатовані з довжиною рядка, що відповідає поточному терміналу (використовуючи значення $B<COLUMNS>, і B<ioctl>(2), якщо вони доступні, або за умовчанням використовується 80 символів, якщо жоден з них недоступний). Сторінки cat будуть збережені лише тоді, коли можливе використання форматування за умовчанням, тобто коли довжина рядка терміналу знаходиться між 66 і 80 символами.

source: Normally, when output is not being directed to a terminal (such as to a file or a pipe), formatting characters are discarded to make it easier to read the result without special tools. However, if $B<MAN_KEEP_FORMATTING> is set to any non-empty value, these formatting characters are retained. This may be useful for wrappers around B<%man%> that can interpret formatting characters.
uk: Зазвичай, коли вивід не спрямовується на термінал (наприклад, у файл або трубу), символи форматування відкидаються для зручнішого читання результату без спеціальних інструментів. Однак, якщо $B<MAN_KEEP_FORMATTING> встановлено в будь-яке непорожнє значення, ці символи форматування зберігаються. Це може бути корисним для обгортки навколо B<%man%>, яка вміє інтерпретувати символи форматування.

source: Normally, when output is being directed to a terminal (usually to a pager), any error output from the command used to produce formatted versions of manual pages is discarded to avoid interfering with the pager's display. Programs such as B<groff> often produce relatively minor error messages about typographical problems such as poor alignment, which are unsightly and generally confusing when displayed along with the manual page. However, some users want to see them anyway, so, if $B<MAN_KEEP_STDERR> is set to any non-empty value, error output will be displayed as usual.
uk: Зазвичай, коли вивід спрямовується до терміналу (зазвичай до гортача), будь-який помилковий вивід з команди, яка використовується для створення форматованих версій сторінок довідки, відкидається, щоб уникнути втручання в показ гортача . Програми, такі як B<groff>, часто виробляють незначні повідомлення про помилки стосовно типографічних проблем, таких як погане вирівнювання, які виглядають непривабливо і зазвичай плутають, коли вони показуються разом зі сторінкою довідки. Однак деяким користувачам все одно хочеться їх побачити, тому якщо $B<MAN_KEEP_STDERR> встановлено на будь-яке непорожнє значення, вивід помилок буде показуватися звичайним чином.

source: On Linux, B<%man%> normally confines subprocesses that handle untrusted data using a B<seccomp>(2) sandbox. This makes it safer to run complex parsing code over arbitrary manual pages. If this goes wrong for some reason unrelated to the content of the page being displayed, you can set $B<MAN_DISABLE_SECCOMP> to any non-empty value to disable the sandbox.
uk: На Linux, B<%man%> зазвичай обмежує підпроцеси, які обробляють ненадійні дані, використовуючи пісочницю B<seccomp>(2). Це робить безпечнішим запуск складного коду аналізу довільних сторінок довідки. Якщо це станеться через якусь причину, не повʼязану з вмістом показаної сторінки, ви можете встановити $B<MAN_DISABLE_SECCOMP> у будь-яке непорожнє значення, щоб вимкнути пісочницю.

source: If the $B<PIPELINE_DEBUG> environment variable is set to "1", then B<%man%> will print debugging messages to standard error describing each subprocess it runs.
uk: Якщо змінна середовища $B<PIPELINE_DEBUG> встановлена у "1", тоді B<%man%> виведе повідомлення про налагодження до стандартного виводу для помилок, описуючи кожен підпроцес, який він запускає.

source: Depending on system and implementation, either or both of $B<LANG> and $B<LC_MESSAGES> will be interrogated for the current message locale. B<%man%> will display its messages in that locale (if available). See B<setlocale>(3) for precise details.
uk: Залежно від системи та реалізації, буде перевірено як $B<LANG>, так і $B<LC_MESSAGES> для поточної мови повідомлень. B<%man%> показуватиме свої повідомлення в цій мові (якщо доступна). Див. B<setlocale>(3).

source: man-db configuration file.
uk: конфігураційний файл man-db.

source: A global manual page hierarchy.
uk: Глобальна ієрархія сторінок довідки.

source: STANDARDS
uk: СТАНДАРТИ

source: Documentation for some packages may be available in other formats, such as B<info>(1) or HTML.
uk: Документація для деяких пакетів може бути доступна в інших форматах, таких як B<info>(1) або HTML.

source: HISTORY
uk: ІСТОРІЯ

source: 1990, 1991 \(en Originally written by John W.\& Eaton (jwe@che.utexas.edu).
uk: 1990, 1991 \(en Оригінально написано Джоном В.\& Ейтоном (jwe@che.utexas.edu).

source: Dec 23 1992: Rik Faith (faith@cs.unc.edu) applied bug fixes supplied by Willem Kasdorp (wkasdo@nikhefk.nikef.nl).
uk: 23 грудня 1992 року: Рік Фейт (faith@cs.unc.edu) застосував виправлення помилок, надані Willem Kasdorp (wkasdo@nikhefk.nikef.nl).

source: 30th April 1994 \(en 23rd February 2000: Wilf.\& (G.Wilford@ee.surrey.ac.uk) has been developing and maintaining this package with the help of a few dedicated people.
uk: 30-го квітня 1994 \(en 23-го Лютого 2000: Wilf.\& (G.Wilford@ee.surrey.ac.uk) розвивав і підтримував цей пакет з допомогою декількох присвячених цьому людей.

source: 30th October 1996 \(en 30th March 2001: Fabrizio Polacco E<lt>fpolacco@debian.orgE<gt> maintained and enhanced this package for the Debian project, with the help of all the community.
uk: 30го жовтня 1996 \(en 30го березня 2001: Fabrizio Polacco E<lt>fpolacco@debian.orgE<gt> підтримував і покращував цей пакет для проекту Debian, з допомогою всієї спільноти.

source: 31st March 2001 \(en present day: Colin Watson E<lt>cjwatson@debian.orgE<gt> is now developing and maintaining man-db.
uk: 31го березня 2001 \(en сьогодення: Colin Watson E<lt>cjwatson@debian.orgE<gt> тепер розробляє і підтримує man-db.

source: %man_recode% - convert manual pages to another encoding
uk: %man_recode% - перекодувати сторінки довідки в іншу кодову сторінку

source: B<%man_recode%> B<-t> I<to-code> {\|B<--suffix=>I<suffix\/>\||\|B<--in-place>\|} [\|B<-dqhV>\|] [\|I<filename>\|]
uk: B<%man_recode%> B<-t> I<в-кодування> {\|B<--suffix=>I<суфікс\/>\||\|B<--in-place>\|} [\|B<-dqhV>\|] [\|I<імʼя_файлу>\|]

source: B<%man_recode%> converts multiple manual pages from one encoding to another, guessing the appropriate input encoding for each one. It is useful when permanently recoding pages written in legacy character sets, or in build systems that need to recode a set of pages to a single common encoding (usually UTF-8) for installation. When converting many manual pages, this program is much faster than running B<%man% --recode> or B<%manconv%> on each page.
uk: B<%man_recode%> перекодовує декілька сторінок довідки з одного кодування в інше, вгадуючи відповідне вхідне кодування для кожної. Це корисно при постійному перекодуванні сторінок, написаних у застарілих символьних наборах, або у системах збірки, які потребують перекодування набору сторінок до єдиного загального кодування (зазвичай це UTF-8) для встановлення. При перетворенні багатьох сторінок довідки ця програма значно швидша, ніж запуск B<%man% --recode> або B<%manconv%> для кожної сторінки.

source: If an encoding declaration is found on the first line of a manual page, then that declaration is used as the input encoding for that page. Failing that, the input encoding is guessed based on the file name.
uk: Якщо в першому рядку сторінки довідника знайдено оголошення кодування, то це оголошення використовується як вхідне кодування для цієї сторінки. В іншому випадку вхідне кодування визначається на основі імені файлу.

source: Encoding declarations have the following form:
uk: Оголошення кодування мають наступну форму:

source: or (if manual page preprocessors are also to be declared):
uk: або (якщо також оголошуються препроцесори сторінок довідки):

source: B<-t> I<encoding\/>, B<--to-code=>I<encoding>
uk: B<-t> I<кодування\/>, B<--to-code=>I<кодування>

source: Convert manual pages to I<encoding>.
uk: Перекодувати сторінки довідки в I<кодування>.

source: B<--suffix=>I<suffix>
uk: B<--suffix=>I<суфікс>

source: Form each output file name by appending I<suffix> to the input file name, after removing any compression extension.
uk: Створювати імʼя кожного вихідного файлу шляхом додавання I<суфікса> до імені вхідного файлу після видалення будь-якого розширення стиснення.

source: Overwrite each input file with the output, after removing any compression extension.
uk: Перезаписати кожен вхідний файл вихідними даними після видалення будь-якого розширення стиснення.

source: Do not issue error messages when the page cannot be converted.
uk: Не видавати повідомлення про помилки, коли сторінку неможливо перекодувати.

source: %manconv% - convert manual page from one encoding to another
uk: %manconv% - перетворення сторінки довідника з одного кодування в інше

source: B<%manconv%> B<-f> [\|I<from-code>\|[:I<from-code>\|.\|.\|.]\|] B<-t> I<to-code> [\|B<-dqhV>\|] [\|I<filename>\|]
uk: B<%manconv%> B<-f> [\|I<з-кодування>\|[:I<з-кодування>\|.\|.\|.]\|] B<-t> I<у-кодування> [\|B<-dqhV>\|] [\|I<імʼя-файлу>\|]

source: B<%manconv%> converts a manual page from one encoding to another, like B<iconv>. Unlike B<iconv>, it can try multiple possible input encodings in sequence. This is useful for manual pages installed in directories without an explicit encoding declaration, since they may be in UTF-8 or in a legacy character set.
uk: B<%manconv%> перетворює сторінку довідки з одного кодування в інше, подібно до B<iconv>. На відміну від B<iconv>, вона може спробувати декілька можливих вхідних кодувань послідовно. Це корисно для сторінок довідки, встановлених у каталогах без явного оголошення кодування, оскільки вони можуть бути в UTF-8 або в застарілому наборі символів.

source: If an encoding declaration is found on the first line of the manual page, that declaration overrides any input encodings specified on B<%manconv%>'s command line. Encoding declarations have the following form:
uk: Якщо в першому рядку сторінки довідника знайдено оголошення кодування, то це оголошення перевизначає будь-які вхідні кодування, зазначені у командному рядку B<%manconv%>. Оголошення кодування мають наступну форму:

source: B<-f> I<encodings>, B<--from-code> I<encodings>
uk: B<-f> I<кодування>, B<--from-code> I<кодування>

source: Try each of I<encodings> (a colon-separated list) in sequence as the input encoding. The default is to guess likely input encodings based on the file name.
uk: Спробувати кожне з I<кодувань> (список, розділений двокрапками), послідовно як вхідне кодування. За замовчуванням програма намагається вгадати можливі вхідні кодування на основі імені файлу.

source: B<-t> I<encoding>, B<--to-code> I<encoding>
uk: B<-t> I<кодування>, B<--to-code> I<кодування>

source: Convert the manual page to I<encoding>.
uk: Перекодувати сторінку довідки в I<кодування>.

source: %manpath% - determine search path for manual pages
uk: %manpath% - визначити шлях пошуку сторінок довідки

source: B<%manpath%> [\|B<-qgdc?V>\|] [\|B<-m> I<system>\|[\|,.\|.\|.\|]\|] [\|B<-C> I<file>\|]
uk: B<%manpath%> [\|B<-qgdc?V>\|] [\|B<-m> I<система>\|[\|,.\|.\|.\|]\|] [\|B<-C> I<файл>\|]

source: If $B<MANPATH> is set, B<%manpath%> will simply display its contents and issue a warning. If not, B<%manpath%> will determine a suitable manual page hierarchy search path and display the results.
uk: Якщо встановлено змінну $B<MANPATH>, B<%manpath%> просто покаже її вміст і видасть попередження. Якщо ні, B<%manpath%> визначить відповідний шлях пошуку сторінок довідки та покаже результати.

source: The colon-delimited path is determined using information gained from the man-db configuration file \(en (I<%manpath_config_file%>) and the user's environment.
uk: Шлях, розділений двокрапками, визначається за допомогою інформації, отриманої з файлу конфігурації man-db (%manpath_config_file%) та середовища користувача.

source: Do not issue warnings.
uk: Не видавати попередження.

source: Produce a catpath as opposed to a manpath. Once the manpath is determined, each path element is converted to its relative catpath.
uk: Створити шляхи_до_талогу замість manpath. Після визначення manpath кожен елемент шляху перетворюється на відносний catpath.

source: Produce a manpath consisting of all paths named as "global" within the man-db configuration file.
uk: Створити шляхи_до_man, який складається з усіх шляхів, названих як «глобальні» у файлі конфігурації man-db.

source: If this system has access to other operating systems' manual hierarchies, this option can be used to include them in the output of B<%manpath%>. To include NewOS's manual page hierarchies use the option B<-m> B<NewOS>.
uk: Якщо ця система має доступ до ієрархій сторінок довідки інших операційних систем, цей параметр можна використовувати для їх включення у вивід B<%manpath%>. Щоб включити ієрархії сторінок довідки NewOS, використовуйте опцію B<-m> B<NewOS>.

source: The I<system> specified can be a combination of comma delimited operating system names. To include the native operating system's manual page hierarchies, the system name B<man> must be included in the argument string. This option will override the $B<SYSTEM> environment variable.
uk: Вказана I<система> може бути комбінацією через кому операційних систем. Для включення рідних ієрархій сторінок довідки системи, у рядку аргументів повинно бути вказано імʼя системного B<man>. Ця опція перевизначить змінну середовища $B<SYSTEM>.

source: If $B<MANPATH> is set, B<%manpath%> displays its value rather than determining it on the fly.
uk: Якщо встановлено змінну середовища $B<MANPATH>, то B<%manpath%> показує її значення, а не визначає його динамічно.

source: %whatis% - display one-line manual page descriptions
uk: %whatis% - показати короткі описи сторінок довідки

source: B<%whatis%> [\|B<-dlv?V>\|] [\|B<-r>\||\|B<-w>\|] [\|B<-s> I<list>\|] [\|B<-m> I<system>\|[\|,.\|.\|.\|]\|] [\|B<-M> I<path>\|] [\|B<-L> I<locale>\|] [\|B<-C> I<file>\|] I<name> \&.\|.\|.
uk: B<%whatis%> [\|B<-dlv?V>\|] [\|B<-r>\||\|B<-w>\|] [\|B<-s> I<список>\|] [\|B<-m> I<система>\|[\|,.\|.\|.\|]\|] [\|B<-M> I<шлях>\|] [\|B<-L> I<локаль>\|] [\|B<-C> I<файл>\|] I<імʼя> \&.\|.\|.

source: Each manual page has a short description available within it. B<%whatis%> searches the manual page names and displays the manual page descriptions of any I<name> matched.
uk: Кожна сторінка довідки має короткий опис, який доступний всередині неї. Команда B<%whatis%> шукає назви сторінок довідки та показує описи тих сторінок довідки, які відповідають I<імені>.

source: I<name> may contain wildcards (B<-w>) or be a regular expression (B<-r>). Using these options, it may be necessary to quote the I<name> or escape (\e) the special characters to stop the shell from interpreting them.
uk: I<Імʼя> може містити шаблони (B<-w>) або бути регулярним виразом (B<-r>). Використовуючи ці опції, можливо, потрібно буде процитувати I<імʼя> або екранувати (\e) спеціальні символи, щоб зупинити їх інтерпретацію оболонкою.

source: B<index> databases are used during the search, and are updated by the B<%mandb%> program. Depending on your installation, this may be run by a periodic cron job, or may need to be run manually after new manual pages have been installed. To produce an old style text B<whatis> database from the relative B<index> database, issue the command:
uk: B<Індексні> бази даних використовуються під час пошуку та оновлюються програмою B<%mandb%>. Залежно від вашої інсталяції, це може бути запущено періодичною задачею cron або, можливо, потрібно вручну запустити її після встановлення нових сторінок довідки. Щоб створити старомодну текстову базу даних B<whatis> з відносної B<індексної> бази даних, виконайте команду:

source: B<%whatis% -M> I<manpath> B<-w '*' | sort E<gt>> I<manpath/whatis>
uk: B<%whatis% -M> I<шляхи_до_man> B<-w '*' | sort E<gt>> I<manpath/whatis>

source: where I<manpath> is a manual page hierarchy such as I</usr/man>.
uk: де I<шляхи_до_man> є ієрархією сторінок довідки, наприклад I</usr/man>.

source: Interpret each I<name> as a regular expression. If a I<name> matches any part of a page name, a match will be made. This option causes B<%whatis%> to be somewhat slower due to the nature of database searches.
uk: Інтерпретувати кожне I<імʼя> як регулярний вираз. Якщо I<імʼя> відповідає будь-якій частині назви сторінки, збіг буде знайдено. Ця опція призводить до того, що B<%whatis%> працює трохи повільніше через особливості пошуку в базі даних.

source: Interpret each I<name> as a pattern containing shell style wildcards. For a match to be made, an expanded I<name> must match the entire page name. This option causes B<%whatis%> to be somewhat slower due to the nature of database searches.
uk: Інтерпретувати кожне I<імʼя> як шаблон, що містить шаблони у стилі оболонки. Для того, щоб збіг був досягнутий, розширене I<імʼя> повинно відповідати цілій назві сторінки. Ця опція призводить до того, що B<%whatis%> працює трохи повільніше через особливості пошуку в базі даних.

source: If this system has access to other operating systems' manual page names, they can be accessed using this option. To search NewOS's manual page names, use the option B<-m> B<NewOS>.
uk: Якщо ця система має доступ до імен сторінок довідки інших операційних систем, вони можуть бути доступні за допомогою цієї опції. Щоб шукати імена сторінок довідки NewOS, використовуйте опцію B<-m> B<NewOS>.

source: The I<system> specified can be a combination of comma delimited operating system names. To include a search of the native operating system's manual page names, include the system name B<man> in the argument string. This option will override the $B<SYSTEM> environment variable.
uk: Вказана I<система> може бути комбінацією операційних систем, перелічених через кому. Для включення пошуку імен сторінок довідки в системі, включіть назву системного B<man> у рядок аргументів. Ця опція перевизначить змінну середовища $B<SYSTEM>.

source: %zsoelim% - satisfy .so requests in roff input
uk: %zsoelim% - задовольняє запити на .so у вхідних даних roff

source: B<%zsoelim%> [\|B<-CVh>\|] [\|I<file> \&.\|.\|.\|]
uk: B<%zsoelim%> [\|B<-CVh>\|] [\|I<файл> \&.\|.\|.\|]

source: B<%zsoelim%> parses I<file> arguments, or if none are specified, its standard input for lines of the form:
uk: B<%zsoelim%> аналізує I<файли>, або якщо вони не вказані, його стандартний ввід щодо рядків у форматі:

source: B<.so> E<lt>\|I<filename>\|E<gt>
uk: B<.so> E<lt>\|I<імʼя файлу>\|E<gt>

source: These requests are replaced by the contents of the I<filename> specified. If the request cannot be met, B<%zsoelim%> looks for I<filename.ext> where I<.ext> can be one of B<.gz>, B<.Z> or B<.z>. Other extension types may be supported depending upon compile time options. If the request can be met by a compressed file, this file is decompressed using an appropriate decompressor and its output is used to satisfy the request.
uk: Ці запити замінюються вмістом файлу I<імʼя_файлу>, який вказаний. Якщо запит не може бути виконаний, B<%zsoelim%> шукає I<імʼя_файлу.роз>, де I<.роз> може бути одним з B<.gz>, B<.Z> або B<.z>. Інші типи розширень можуть підтримуватися в залежності від опцій компіляції. Якщо запит може бути виконаний за допомогою стисненого файлу, цей файл розпаковується за допомогою відповідного декомпресора, і його вивід використовується для задоволення запиту.

source: Traditionally, B<soelim> programs were used to allow roff preprocessors to be able to preprocess the files referred to by the requests. This particular version was written to circumvent problems created by support for compressed manual pages.
uk: Традиційно програми B<soelim> використовувалися для того, щоб дозволити препроцесорам roff обробляти файли, на які посилаються запити. Ця конкретна версія була написана для обходу проблем, створених підтримкою стиснутих сторінок довідки.

source: This flag is available for compatibility with other B<soelim> programs. Its use is to enable .so requests followed by something other than whitespace. As this is already the default behaviour, it is ignored.
uk: Цей прапорець доступний для сумісності з іншими програмами B<soelim>. Його використання полягає в тому, щоб дозволити .so запити, які не відділені пробілом. Оскільки це вже є стандартною поведінкою, він ігнорується.

source: manpath - format of the %manpath_config_file% file
uk: manpath - формат файлу %manpath_config_file%

source: The manpath configuration file is used by the manual page utilities to assess users' manpaths at run time, to indicate which manual page hierarchies (manpaths) are to be treated as system hierarchies and to assign them directories to be used for storing cat files.
uk: Файл конфігурації manpath використовується утилітами сторінок довідки для оцінки шляхів користувачів під час роботи, щоб вказати, які ієрархії сторінок довідки (manpaths) повинні розглядатися як системні ієрархії та призначати їм каталоги для зберігання файлів cat.

source: If the environment variable $B<MANPATH> is already set, the information contained within %manpath_config_file% will not override it.
uk: Якщо змінна середовища $B<MANPATH> вже встановлена, інформація, яка міститься у %manpath_config_file%, не буде її перезаписувати.

source: SEARCH PATH
uk: ШЛЯХ ПОШУКУ

source: By default, man-db examines the user's $B<PATH>. For each I<path_element> found there, it adds I<manpath_element> to the search path.
uk: За замовчуванням, man-db перевіряє шлях користувача $B<PATH>. Для кожного знайденого тут I<елементу_шляху>, воно додає I<елемент_шляху> до шляху пошуку.
