Repository: codacy-open-source-projects-scans/man-db
Catalog: man/po4a/po/*.po
Languages: uk

source: If there is no B<MANPATH_MAP> line in the configuration file for a given I<path_element>, then it adds all of I<path_element/../man>, I<path_element/man>, I<path_element/../share/man>, and I<path_element/share/man> that exist as directories to the search path.
uk: Якщо у конфігураційному файлі немає рядка B<MANPATH_MAP> для заданого I<елементу_шляху>, тоді до шляху пошуку додаються всі наявні каталоги I<елементи_шляху/../man>, I<елементи_шляху/man>, I<елементи_шляху/../share/man>, та I<елементи_шляху/share/man>.

source: It then adds any B<MANDATORY_MANPATH> entries from the configuration file to the search path.
uk: Потім додає всі записи B<MANDATORY_MANPATH> з файлу конфігурації до шляху пошуку.

source: Finally, if the B<--systems> option is used or the $B<SYSTEM> environment variable is set, then that should consist of a sequence of operating system names separated by commas or colons. This acts as a template, expanding the search path once more to allow access to other operating systems' manual pages: for each system name, man-db looks for that name as a subdirectory of each entry in the search path, and adds it to the final search path if it exists. A system name of B<man> inserts the normal search path without subdirectories. For example, if the search path would otherwise have been I</usr/share/man:/usr/local/man>, and $B<SYSTEM> is set to I<newOS:man>, then the final search path will be I</usr/share/man/newOS:\:/usr/share/man:\:/usr/local/man/newOS:\:/usr/local/man>.
uk: Нарешті, якщо використовується опція B<--systems> або встановлена змінна середовища $B<SYSTEM>, то це повинно складатися з послідовності імен операційних систем, розділених комами або двокрапками. Це діє як шаблон, розширюючи шлях пошуку ще раз, щоб дозволити доступ до сторінок керівництва інших операційних систем: для кожної назви системи man-db шукає цю назву як підкаталог кожного запису у шляху пошуку та додає його до остаточного шляху пошуку, якщо він існує. Назва системного B<man> вставляє звичайний шлях пошуку без підкаталогів. Наприклад, якщо шлях пошуку був би I</usr/share/man:/usr/local/man>, а $B<SYSTEM> встановлено на I<newOS:man>, то остаточний шлях пошуку буде I</usr/share/man/newOS:\:/usr/share/man:\:/usr/local/man/newOS:\:/usr/local/man>.

source: The $B<MANPATH> environment variable overrides man-db's default manual page search paths. Most users should not need to set it. Its syntax is similar to the $B<PATH> environment variable: it consists of a sequence of directory names separated by colons. It overrides the default search path described above.
uk: Змінна середовища $B<MANPATH> перекриває шляхи пошуку сторінок довідки за замовчуванням у man-db. Зазвичай користувачам не потрібно її встановлювати. Синтаксис схожий на змінну середовища $B<PATH>: вона складається з послідовності імен каталогів, розділених двокрапками. Вона перекриває типовий шлях пошуку, описаний вище.

source: If the value of $B<MANPATH> starts with a colon, then the default search path is added at its start. If the value of $B<MANPATH> ends with a colon, then the default search path is added at its end. If the value of $B<MANPATH> contains a double colon (B<::>), then the default search path is inserted in the middle of the value, between the two colons.
uk: Якщо значення $B<MANPATH> починається з двокрапки, то допоміжний шлях пошуку додається на початок. Якщо значення $B<MANPATH> закінчується двокрапкою, то допоміжний шлях пошуку додається в кінець. Якщо значення $B<MANPATH> містить подвійну двокрапку (B<::>), то допоміжний шлях пошуку вставляється посередині значення, між двома двокрапками.

source: FORMAT
uk: ФОРМАТ

source: The following field types are currently recognised:
uk: Наступні типи полів визнаються зараз:

source: B<#>I<\ comment>
uk: B<#>I<\ коментар>

source: Blank lines or those beginning with a B<#> will be treated as comments and ignored.
uk: Порожні рядки або ті, що починаються з B<#>, будуть вважатися коментарями і проігноровані.

source: B<MANDATORY_MANPATH>I<\ manpath_element>
uk: B<MANDATORY_MANPATH>I<\ елемент_шляхів_до_man>

source: Lines of this form indicate manpaths that every automatically generated $B<MANPATH> should contain. This will typically include I</usr/man>.
uk: Ці рядки вказують на шляхи до каталогів, які повинні бути включені до кожного автоматично згенерованого $B<MANPATH>. Зазвичай це включає I</usr/man>.

source: B<MANPATH_MAP>I<\ path_element\ manpath_element>
uk: B<MANPATH_MAP>I<\ елемент_шлях\ елемент_шляхів_до_man>

source: Lines of this form set up $B<PATH> to $B<MANPATH> mappings. For each I<path_element> found in the user's $B<PATH>, I<manpath_element> will be added to the $B<MANPATH>.
uk: Ці рядки встановлюють відповідність між елементами шляху $B<PATH> та $B<MANPATH>. Для кожного знайденого I<елементу_шляху> у $B<PATH> користувача, I<елемент_шляху_до_man> буде додано до $B<MANPATH>.

source: B<MANDB_MAP >I<manpath_element >\|[\| I<catpath_element> \|]
uk: B<MANDB_MAP >I<елемент_шляхів_до_man>\|[\| I<елемент_шляхів_до_cat> \|]

source: Lines of this form indicate which manpaths are to be treated as system manpaths, and optionally where their cat files should be stored. This field type is particularly important if B<man> is a setuid program, as (when in the system configuration file %manpath_config_file% rather than the per-user configuration file .manpath) it indicates which manual page hierarchies to access as the setuid user and which as the invoking user.
uk: Ці рядки вказують, які шляхи до man повинні розглядатися як системні шляхи і, необовʼязково, де мають зберігатися їхні файли cat. Цей тип полів особливо важливий, якщо B<man> є програмою з правами setuid, оскільки вона вказує, які ієрархії сторінок довідки потрібно отримувати від користувача setuid, а які - від користувача що викликав команду (при наявності у системному конфігураційному файлі %manpath_config_file% замість персонального конфігураційного файлу .manpath).

source: The system manual page hierarchies are usually those stored under I</usr> such as I</usr/man>, I</usr/local/man> and I</usr/X11R6/man>.
uk: Системні ієрархії сторінок довідки зазвичай зберігаються в /usr, такі як /usr/man, /usr/local/man та /usr/X11R6/man.

source: If cat pages from a particular I<manpath_element> are not to be stored or are to be stored in the traditional location, I<catpath_element> may be omitted.
uk: Якщо сторінки каталогу з певного I<елементу_шляху_до_man> не повинні зберігатися або мають бути збережені в традиційному розташуванні, то можна опустити I<елементу_шляху_до_cat>.

source: Traditional cat placement would be impossible for read only mounted manual page hierarchies and because of this it is possible to specify any valid directory hierarchy for their storage. To observe the B<Linux FSSTND> the keyword B<FSSTND> can be used in place of an actual directory.
uk: Традиційне розміщення файлів cat було б неможливим для ієрархій сторінок довідки змонтованих тільки для читання, тому, через це, можна вказати будь-яку дійсну ієрархію каталогів для зберігання їх. Щоб відповідати стандарту B<Linux FSSTND>, замість фактичного каталогу можна використовувати ключове слово B<FSSTND>.

source: Unfortunately, it is necessary to specify B<all> system man tree paths, including alternate operating system paths such as I</usr/man/sun> and any B<NLS locale> paths such as I</usr/man/de_DE.88591>.
uk: На жаль, необхідно вказати B<ВСІ> шляхи до дерева системних сторінок man, включаючи альтернативні шляхи операційної системи, такі як I</usr/man/sun>, а також будь-які шляхи B<NLS locale>, наприклад I</usr/man/de_DE.88591>.

source: As the information is parsed line by line in the order written, it is necessary for any manpath that is a sub-hierarchy of another hierarchy to be listed first, otherwise an incorrect match will be made. An example is that I</usr/man/de_DE.88591> must come before I</usr/man>.
uk: Оскільки інформація аналізується по рядку в тому порядку, в якому вони записані, необхідно, щоб будь-який шлях до man, який є підієрархією іншої ієрархії, був перерахований першим, інакше буде зроблено неправильну відповідність. Наприклад, шлях I</usr/man/de_DE.88591> повинен йти перед I</usr/man>.

source: B<DEFINE>I<\ key\ value>
uk: B<DEFINE>I<\ ключ\ значення>

source: Lines of this form define miscellaneous configuration variables; see the default configuration file for those variables used by the manual pager utilities. They include default paths to various programs (such as I<grep> and I<tbl>), and default sets of arguments to those programs.
uk: Ці рядки визначають різні конфігураційні змінні; дивіться файл конфігурації за замовчуванням для тих змінних, які використовуються утилітами переглядача сторінок. Вони включають шляхи за замовчуванням до різних програм (таких як I<grep> і I<tbl>) та набори аргументів для цих програм.

source: B<SECTION> I<section> .\|.\|.
uk: B<SECTION> I<розділ> .\|.\|.

source: Lines of this form define the order in which manual sections should be searched. If there are no B<SECTION> directives in the configuration file, the default is:
uk: Ці рядки визначають порядок пошуку розділів довідки. Якщо в конфігураційному файлі немає директив B<SECTION>, то за замовчуванням використовується:

source: If multiple B<SECTION> directives are given, their section lists will be concatenated.
uk: Якщо вказано кілька директив B<SECTION>, їхні списки розділів будуть обʼєднані.

source: If a particular extension is not in this list (say, 1mh) it will be displayed with the rest of the section it belongs to. The effect of this is that you only need to explicitly list extensions if you want to force a particular order. Sections with extensions should usually be adjacent to their main section (e.g.\& "1 1mh 8 ...").
uk: Якщо певне розширення не знаходиться у цьому списку (наприклад, 1mh), воно буде показано разом з іншою секцією, до якої воно належить. Наслідком є те, що вам потрібно вказати розширення явно лише тоді, коли ви хочете задати певний порядок. Секції з розширеннями зазвичай повинні бути суміжними з їхньою основною секцією (наприклад, "1 1mh 8 ...").

source: B<SECTIONS> is accepted as an alternative name for this directive.
uk: B<SECTIONS> також приймається як альтернативна назва для цієї директиви.

source: B<MINCATWIDTH>I<\ width>
uk: B<MINCATWIDTH>I<\ ширина>

source: If the terminal width is less than I<width>, cat pages will not be created (if missing) or displayed. The default is 80.
uk: Якщо ширина терміналу менша за I<ширину>, сторінки cat не будуть створені (якщо їх немає) або показані. За замовчуванням це 80.

source: B<MAXCATWIDTH>I<\ width>
uk: B<MAXCATWIDTH>I<\ ширина>

source: If the terminal width is greater than I<width>, cat pages will not be created (if missing) or displayed. The default is 80.
uk: Якщо ширина терміналу більша за I<ширину>, сторінки cat не будуть створені (якщо вони відсутні) або показані. За замовчуванням це 80.

source: B<CATWIDTH>I<\ width>
uk: B<CATWIDTH>I<\ ширина>

source: If I<width> is non-zero, cat pages will always be formatted for a terminal of the given width, regardless of the width of the terminal actually being used. This overrides B<MINCATWIDTH> and B<MAXCATWIDTH>.
uk: Якщо I<ширина> не дорівнює нулю, сторінки cat будуть завжди форматовані для терміналу вказаної ширини, незалежно від фактично використовуваного терміналу. Це перевизначає B<MINCATWIDTH> та B<MAXCATWIDTH>.

source: This flag prevents B<%man%>(1) from creating cat pages automatically.
uk: Цей прапорець забороняє B<%man%>(1) автоматично створювати сторінки категорій.

source: Unless the rules above are followed and observed precisely, the manual pager utilities will not function as desired. The rules are overly complicated.
uk: Якщо правила вище не будуть дотримані точно, утиліти переглядача сторінок не працюватимуть так, як бажано. Правила занадто складні.

source: accessdb - dumps the content of a man-db database in a human readable format
uk: accessdb - виводить вміст бази даних man-db у зрозумілому для людини форматі

source: B</usr/sbin/accessdb> [\|B<-d?V>\|] [I<E<lt>index-fileE<gt>>]
uk: B</usr/sbin/accessdb> [\|B<-d?V>\|] [I<E<lt>індексний файлE<gt>>]

source: B<accessdb> will output the data contained within a man-db database in a human readable form. By default, it will dump the data from B</var/cache/man/index.E<lt>db-typeE<gt>,> where E<lt>db-typeE<gt> is dependent on the database library in use.
uk: B<accessdb> виведе дані, що містяться в базі даних man-db у зрозумілому для людини форматі. За замовчуванням, вона вивантажить дані з B</var/cache/man/index.E<lt>db-typeE<gt>,> де E<lt>db-typeE<gt> залежить від використовуваної бібліотеки бази даних.

source: Supplying an argument to accessdb will override this default.
uk: Надання аргументу до accessdb замінить цей типовий параметр.

source: %catman% - create or update the pre-formatted manual pages
uk: %catman% - створити або оновл сторінки довідки у форматованому вигляді

source: B<%catman%> [\|B<-d?V>\|] [\|B<-M> I<path>\|] [\|B<-C> I<file>\|] [\|I<section>\|] \&.\|.\|.
uk: B<%catman%> [\|B<-d?V>\|] [\|B<-М> I<шлях>\|] [\|B<-C> I<файл>\|] [\|I<розділ>\|] \&.\|.\|.

source: B<%catman%> is used to create an up to date set of pre-formatted manual pages known as cat pages. Cat pages are generally much faster to display than the original manual pages, but require extra storage space. The decision to support cat pages is that of the local administrator, who must provide suitable directories to contain them.
uk: B<%catman%> використовується для створення актуального набору попередньо форматованих сторінок довідки, відомих як сторінки cat. Сторінки cat зазвичай значно швидше показуються, ніж оригінальні сторінки довідки, але вимагають додаткового місця для зберігання. Рішення щодо підтримки сторінок cat належить місцевому адміністратору, який повинен забезпечити відповідні каталоги для їхнього зберігання.

source: The options available to B<%catman%> are the manual page hierarchies and sections to pre-format. The default hierarchies are those specified as system hierarchies in the man-db configuration file, and the default sections are either the colon-delimited contents of the environment variable $B<MANSECT> or the standard set compiled into B<%man%> if $B<MANSECT> is undefined. Supplying B<%catman%> with a set of whitespace-delimited section names will override both of the above.
uk: Опції, доступні для B<%catman%>, це ієрархії та розділи сторінок довідки, які потрібно підготувати заздалегідь. За замовчуванням використовуються ієрархії, вказані у файлі конфігурації man-db як системні ієрархії, а також розділи або зміст змінної середовища $B<MANSECT>, або стандартний набір, який вбудовано до B<%man%>, якщо $B<MANSECT> не визначено. Надання B<%catman%> набору розділів, розділених пробілами, перевизначить обидва вищезгадані варіанти.

source: B<%catman%> makes use of the B<index> database cache associated with each hierarchy to determine which files need to be formatted.
uk: B<%catman%> використовує B<індекс> кешу бази даних, повʼязаний з кожною ієрархією, щоб визначити, які файли потрібно форматувати.

source: Specify an alternate colon-delimited manual page hierarchy search path. By default, this is all paths indicated as system hierarchies in the man-db configuration file.
uk: Вказати альтернативний шлях пошуку ієрархії сторінок довідки, розділених двокрапками. За замовчуванням це всі шляхи, вказані як системні ієрархії у файлі конфігурації man-db.

source: An alternate or FSSTND compliant global I<index> database cache.
uk: Альтернативний або сумісний з FSSTND глобальний кеш бази даних I<індексу>.

source: %mandb% - create or update the manual page index caches
uk: %mandb% - створює або оновлює кеші індексу сторінок довідки

source: B<%mandb%> [\|B<-dqsucpt?V>\|] [\|B<-C> I<file>\|] [\|I<manpath>\|]
uk: B<%mandb%> [\|B<-dqsucpt?V>\|] [\|B<-C> I<файл>\|] [\|I<шляхи_до_man>\|]

source: B<%mandb%> [\|B<-dqsut>\|] [\|B<-C> I<file>\|] B<-f> I<filename>\ .\|.\|.
uk: B<%mandb%> [\|B<-dqsut>\|] [\|B<-C> I<файл>\|] B<-f> I<імʼя_файлу>\ .\|.\|.

source: B<%mandb%> is used to initialise or manually update B<index> database caches. The caches contain information relevant to the current state of the manual page system and the information stored within them is used by the man-db utilities to enhance their speed and functionality.
uk: B<%mandb%> використовується для ініціалізації або ручного оновлення кешів бази даних B<індексі>. Ці кеші містять інформацію, що стосується поточного стану системи сторінок довідки, а інформація, збережена в них, використовується утилітами man-db для покращення їхньої швидкості та функціональності.

source: When creating or updating an B<index>, B<%mandb%> will warn of bad ROFF .so requests, bogus manual page filenames and manual pages from which the B<whatis> cannot be parsed.
uk: Під час створення або оновлення індексу B<%mandb%> попереджатиме про неправильні запити ROFF .so, хибні імена файлів сторінок довідки та сторінки довідки, з яких не можливо розібрати B<whatis>.

source: Supplying B<%mandb%> with an optional colon-delimited path will override the internal system manual page hierarchy search path, determined from information found within the man-db configuration file.
uk: Надання B<%mandb%> необовʼязкового шляху, розділеного двокрапкою, перевизначить внутрішній системний ієрархічний шлях пошуку сторінок довідки, визначений на основі інформації, знайденої у файлі конфігурації man-db.

source: DATABASE CACHES
uk: КЕШИ БАЗ ДАНИХ

source: B<%mandb%> can be compiled with support for any one of the following database types.
uk: B<%mandb%> може бути скомпільовано з підтримкою будь-якого з наступних типів баз даних.

source: Name
uk: Імʼя

source: Async
uk: Асинхронний

source: Filename
uk: Імʼя файлу

source: Berkeley db
uk: Берклійська база даних

source: Yes
uk: Так

source: No
uk: Ні

source: I<index.(dir|pag)>
uk: I<індекс.(каталог|сторінка)>

source: Those database types that support asynchronous updates provide enhanced speed at the cost of possible corruption in the event of unusual termination. In an unusual case where this has occurred, it may be necessary to rerun B<%mandb%> with the B<-c> option to re-create the databases from scratch.
uk: Ті типи баз даних, які підтримують асинхронні оновлення, забезпечують покращену швидкість за рахунок можливого пошкодження у разі незвичайного завершення. У незвичайному випадку, коли це сталося, можливо необхідно повторно запустити B<%mandb%> з опцією B<-c>, щоб перестворити бази даних з нуля.

source: Produce no warnings.
uk: Не видавати жодних попереджень.

source: Do not spend time looking for or adding information to the databases regarding stray cats.
uk: Не витрачати час на пошук або додавання інформації про безхатьків у базах даних.

source: Do not spend time checking for deleted manual pages and purging them from the databases.
uk: Не витрачати час на перевірку видалених сторінок довідки та їх очищення з баз даних.

source: By default, B<%mandb%> will try to update any previously created databases. If a database does not exist, it will create it. This option forces B<%mandb%> to delete previous databases and re-create them from scratch, and implies B<--no-purge.> This may be necessary if a database becomes corrupt or if a new database storage scheme is introduced in the future.
uk: За замовчуванням, B<%mandb%> намагається оновити будь-які раніше створені бази даних. Якщо база даних не існує, вона її створить. Ця опція змушує B<%mandb%> видалити попередні бази даних та повторно створити їх з нуля, і передбачає B<--no-purge>. Це може бути необхідним, якщо база даних стала пошкодженою або, якщо в майбутньому буде введена нова схема зберігання бази даних.

source: Create user databases only, even with write permissions necessary to create system databases.
uk: Створювати тільки користувацькі бази даних, навіть з необхідними правами запису для створення системних баз даних.

source: Perform correctness checks on manual pages in the hierarchy search path. With this option, B<%mandb%> will not alter existing databases.
uk: Виконувати перевірку правильності сторінок довідки у шляху пошуку ієрархії. З цим параметром, B<%mandb%> не змінюватиме існуючі бази даних.

source: Update only the entries for the given filename. This option is not for general use; it is used internally by B<%man%> when it has been compiled with the B<MAN_DB_UPDATES> option and finds that a page is out of date. It implies B<-p> and disables B<-c> and B<-s>.
uk: Оновити тільки записи для вказаного імені файлу. Ця опція не призначена для загального використання; вона використовується внутрішньо B<%man%>, коли він був скомпільований з опцією B<MAN_DB_UPDATES> і виявив, що сторінка неактуальна. Вона передбачає B<-p> та вимикає B<-c> та B<-s>.

source: Show the usage message, then exit.
uk: Показати повідомлення про використання, а потім вийти.

source: Show the version, then exit.
uk: Показати версію, а потім вийти.

source: Usage, syntax, or configuration file error.
uk: Помилка використання, синтаксису або файлу конфігурації.

source: A child process failed.
uk: Дочірній процес не вдалося виконати.

source: DIAGNOSTICS
uk: ДІАГНОСТИКА

source: The following warning messages can be emitted during database building.
uk: Під час створення бази даних можуть виникати наступні попередження.

source: B<E<lt>filenameE<gt>: whatis parse for page(sec) failed>
uk: B<E<lt>filenameE<gt>: розбір сторінки з допомогою whatis не вдався>

source: An attempt to extract whatis line(s) from the given E<lt>filenameE<gt> failed. This is usually due to a poorly written manual page, but if many such messages are emitted it is likely that the system contains non-standard manual pages which are incompatible with the man-db whatis parser. See the B<WHATIS PARSING> section in B<lexgrog>(1) for more information.
uk: Спроба вилучити whatis рядки з вказаного E<lt>filenameE<gt> не вдалася. Це зазвичай спричинено погано написаною сторінкою довідки, але якщо багато таких повідомлень виникає, ймовірно, система містить нестандартні сторінки довідки, які несумісні з аналізатором whatis man-db. Для отримання додаткової інформації дивіться розділ B<WHATIS PARSING> у B<lexgrog>(1).

source: B<E<lt>filenameE<gt>: is a dangling symlink>
uk: B<E<lt>filenameE<gt>: це недійсне символічне посилання>

source: E<lt>filenameE<gt> does not exist but is referenced by a symbolic link. Further diagnostics are usually emitted to identify the E<lt>filenameE<gt> of the offending link.
uk: E<lt>filenameE<gt> не існує, але він є посиланням символічного типу. Зазвичай видаються додаткові діагностичні дані для визначення E<lt>filenameE<gt> порушуючого посилання.

source: B<E<lt>filenameE<gt>: bad symlink or ROFF `.so' request>
uk: B<E<lt>filenameE<gt>: помилкове символічне посилання або неправильний запит ROFF «.so»>

source: E<lt>filenameE<gt> is either a symbolic link to, or contains a ROFF include request to, a non existent file.
uk: E<lt>filenameE<gt> є символьним посиланням на або містить запит на включення ROFF до неіснуючого файлу.

source: B<E<lt>filenameE<gt>: ignoring bogus filename>
uk: B<E<lt>filenameE<gt>: ігнорування неправильного імені файлу>

source: The E<lt>filenameE<gt> may or may not be a valid manual page but its name is invalid. This is usually due to a manual page with sectional extension E<lt>xE<gt> being put in manual page section E<lt>yE<gt>.
uk: E<lt>filenameE<gt> може бути або не бути дійсною сторінкою довідки, але його імʼя є недійсним. Це зазвичай через те, що сторінка довідки з розширенням секції E<lt>xE<gt> поміщена в секцію сторінок довідки E<lt>yE<gt>.

source: B<E<lt>filename_maskE<gt>: competing extensions>
uk: B<E<lt>filename_maskE<gt>: конфліктні розширення>
