Repository: codacy-open-source-projects-scans/man-db
Catalog: man/po4a/po/*.po
Languages: uk

source: The wildcard E<lt>filename_maskE<gt> is not unique. This is usually caused by the existence of both a compressed and uncompressed version of the same manual page. All but the most recent are ignored.
uk: Шаблон E<lt>filename_maskE<gt> не є унікальним. Це зазвичай спричинено наявністю як стиснутої, так і розпакованої версії однієї й тієї ж сторінки довідника. Ігноруються всі, окрім найновішої.

source: Older locations for the database cache included:
uk: Старі розташування кешу бази даних включали:

source: The B<WHATIS PARSING> section formerly in this manual page is now part of B<lexgrog>(1).
uk: Розділ B<РОЗБІР WHATIS>, який був у цій сторінці керівництва, тепер частина B<lexgrog>(1).
