Repository: codacy-open-source-projects-scans/man-db
Catalog: man/po4a/po/*.po
Languages: uk

source: The given I<list> is a colon- or comma-separated list of sections, used to determine which manual sections to search and in what order. This option overrides the $B<MANSECT> environment variable. (The B<-s> spelling is for compatibility with System V.)
uk: Заданий I<список> є списком розділених комами або двокрапками секцій, який використовується для визначення порядку пошуку та в яких саме розділах довідки. Ця опція перевизначає змінну середовища $B<MANSECT>. (Варіант B<-s> забезпечує сумісність з System V.)

source: B<-e\ >I<sub-extension>,\ B<--extension=>I<sub-extension>
uk: B<-e\ >I<під-розширення>,\ B<--extension=>I<під-розширення>

source: Some systems incorporate large packages of manual pages, such as those that accompany the B<Tcl> package, into the main manual page hierarchy. To get around the problem of having two manual pages with the same name such as B<exit>(3), the B<Tcl> pages were usually all assigned to section B<l>. As this is unfortunate, it is now possible to put the pages in the correct section, and to assign a specific "extension" to them, in this case, B<exit>(3tcl). Under normal operation, B<%man%> will display B<exit>(3) in preference to B<exit>(3tcl). To negotiate this situation and to avoid having to know which section the page you require resides in, it is now possible to give B<%man%> a I<sub-extension> string indicating which package the page must belong to. Using the above example, supplying the option B<-e\ tcl> to B<%man%> will restrict the search to pages having an extension of B<*tcl>.
uk: Деякі системи включають великі пакети сторінок довідки, такі як ті, що супроводжують пакет B<Tcl>, у головну ієрархію сторінок довідки. Щоб обійти проблему наявності двох сторінок довідки з однаковою назвою, такою як B<exit>(3), сторінки B<Tcl> зазвичай були призначені для розділу B<l>. Оскільки це небажано, тепер можливо розмістити сторінки у правильному розділі та присвоїти їм конкретне "розширення", наприклад, B<exit>(3tcl). За звичайних умов B<%man%> показує B<exit>(3) замість B<exit>(3tcl). Щоб уникнути необхідності знати, в якому розділі знаходиться потрібна сторінка довідки, тепер можливо надати B<%man%> рядок I<під-розширень>, який вказує, до якого пакету повинна належати сторінка. Використовуючи вищезазначений приклад, надання опції B<-e\ tcl> до B<%man%> обмежить пошук сторінок з розширенням B<*tcl>.

source: Ignore case when searching for manual pages. This is the default.
uk: Ігнорувати регістр при пошуку сторінок довідки. Це значення за замовчуванням.

source: Search for manual pages case-sensitively.
uk: Шукати сторінки довідки з урахуванням регістру.

source: Show all pages with any part of either their names or their descriptions matching each I<page> argument as a regular expression, as with B<apropos>(1). Since there is usually no reasonable way to pick a "best" page when searching for a regular expression, this option implies B<-a>.
uk: Показати всі сторінки, у яких будь-яка частина їхніх імен або описів відповідає кожному аргументу I<сторінка> як регулярному виразу, як це робиться з B<apropos>(1). Оскільки зазвичай немає розумного способу вибрати «кращу» сторінку при пошуку за регулярним виразом, ця опція передбачає B<-a>.

source: Show all pages with any part of either their names or their descriptions matching each I<page> argument using shell-style wildcards, as with B<apropos>(1) B<--wildcard>. The I<page> argument must match the entire name or description, or match on word boundaries in the description. Since there is usually no reasonable way to pick a "best" page when searching for a wildcard, this option implies B<-a>.
uk: Показати всі сторінки, у яких будь-яка частина їхніх назв або описів відповідає кожному аргументу I<сторінка>, використовуючи шаблони командного рядка, як у B<apropos>(1) з опцією B<--wildcard>. Аргумент I<сторінка> повинен повністю відповідати назві або опису, або відповідати у межах слів у описі. Оскільки зазвичай немає розумного способу вибрати "кращу" сторінку при пошуку за шаблоном, ця опція передбачає B<-a>.

source: If the B<--regex> or B<--wildcard> option is used, match only page names, not page descriptions, as with B<whatis>(1). Otherwise, no effect.
uk: Якщо використовуються опції B<--regex> або B<--wildcard>, то шукається збіг тільки за назвами сторінок, а не їх описами, як це робиться в B<whatis>(1). В іншому випадку, ефекту немає.

source: By default, B<%man%> will exit after displaying the most suitable manual page it finds. Using this option forces B<%man%> to display all the manual pages with names that match the search criteria.
uk: За замовчуванням, B<%man%> завершиться після показу найпридатнішої сторінки довідника. Використання цієї опції змусить B<%man%> показати всі сторінки довідників, імена яких відповідають критеріям пошуку.

source: This option causes B<%man%> to update its database caches of installed manual pages. This is only needed in rare situations, and it is normally better to run B<%mandb%>(8) instead.
uk: Ця опція призводить до оновлення кешів бази даних B<%man%>, які містять встановлені сторінки довідки. Це потрібно лише у рідкісних ситуаціях, і зазвичай краще запускати B<%mandb%>(8) натомість.

source: By default, B<%man%> will try to interpret pairs of manual page names given on the command line as equivalent to a single manual page name containing a hyphen or an underscore. This supports the common pattern of programs that implement a number of subcommands, allowing them to provide manual pages for each that can be accessed using similar syntax as would be used to invoke the subcommands themselves. For example:
uk: За замовчуванням, B<%man%> намагається інтерпретувати пари імен сторінок довідки, вказаних у командному рядку, як еквівалент однієї сторінки довідки з дефісом або підкресленням. Це підтримує поширений шаблон програм, які реалізують кілька підкоманд, дозволяючи їм надавати сторінки довідки для кожної з них, доступ до яких можна отримати за допомогою синтаксису, схожого на використання при виклику самих підкоманд. Наприклад:

source: To disable this behaviour, use the B<--no-subpages> option.
uk: Щоб вимкнути цю поведінку, використовуйте опцію B<--no-subpages>.

source: Controlling formatted output
uk: Керування форматованим виведенням

source: B<-P\ >I<pager>,\ B<--pager=>I<pager>
uk: B<-P\ >I<гортач>,\ B<--pager=>I<гортач>

source: Specify which output pager to use. By default, B<%man%> uses B<%pager%>, falling back to B<%cat%> if B<%pager%> is not found or is not executable. This option overrides the $B<MANPAGER> environment variable, which in turn overrides the $B<PAGER> environment variable. It is not used in conjunction with B<-f> or B<-k>.
uk: Вкажіть програму, гортача виводу. За замовчуванням, B<%man%> використовує B<%pager%>, якщо B<%pager%> не знайдено або не є виконуваним файлом, тоді використовується B<%cat%>. Ця опція перевизначає змінну середовища $B<MANPAGER>, яка в свою чергу перевизначає змінну середовища $B<PAGER>. Вона не використовується разом з B<-f> або B<-k>.

source: The value may be a simple command name or a command with arguments, and may use shell quoting (backslashes, single quotes, or double quotes). It may not use pipes to connect multiple commands; if you need that, use a wrapper script, which may take the file to display either as an argument or on standard input.
uk: Значенням може бути просте імʼя команди або команда з аргументами, які можуть використовувати цитування для оболонки (зворотні похилі риски, одинарні або подвійні лапки). Вона не може використовувати канали для підключення декількох команд; якщо вам потрібно це, використовуйте обгортковий скрипт, який може приймати файл для показу або на стандартному вводі.

source: B<-r\ >I<prompt>,\ B<--prompt=>I<prompt>
uk: B<-r\ >I<запрошення>,\ B<--prompt=>I<запрошення>

source: If a recent version of B<less> is used as the pager, B<%man%> will attempt to set its prompt and some sensible options. The default prompt looks like
uk: Якщо недавня версію B<less> використовується як гортач сторінок, B<%man%> намагатиметься встановити його рядок запрошення і декілька розумних опцій. За замовчуванням запрошення виглядає так

source: B< Manual page>I< name>B<(>I<sec>B<) line>I< x>
uk: B< Сторінки довідника>I< назва>(I<розділ>B<) рядок>I< x>

source: where I<name> denotes the manual page name, I<sec> denotes the section it was found under and I<x> the current line number. This is achieved by using the $B<LESS> environment variable.
uk: де I<імʼя> позначає назву сторінки довідника, I<розділ> - розділ, де вона була знайдена, а I<x> - поточний номер рядка. Це досягається за допомогою змінної середовища $B<LESS>.

source: Supplying B<-r> with a string will override this default. The string may contain the text B<$MAN_PN> which will be expanded to the name of the current manual page and its section name surrounded by "(" and ")". The string used to produce the default could be expressed as
uk: При вказанні B<-r> з рядком, буде перевизначено це значення за замовчуванням. Рядок може містити текст B<$MAN_PN>, який буде розширений до імені поточної сторінки керівництва та її назви розділу, оточених «(» і «)». Рядок, який використовується для створення замовчування, може бути виражений як

source: B<\e\ Manual\e\ page\e\ \e$MAN_PN\e\ ?ltline\e\ %lt?L/%L.:>
uk: B<\e\ Сторінка\e\ довідки\e\ $MAN_PN\e\ ?ltрядок\e\ %lt?L/%L.:>

source: B<byte\e\ %bB?s/%s..?\e\ (END):?pB\e\ %pB\e\e%..>
uk: B<байт\e\ %bB?s/%s..?\e\ (КІНЕЦЬ):?pB\e\ %pB\e\e%..>

source: B<(press h for help or q to quit)>
uk: B<(натисніть h для довідки або q, щоб вийти)>

source: It is broken into three lines here for the sake of readability only. For its meaning see the B<less>(1) manual page. The prompt string is first evaluated by the shell. All double quotes, back-quotes and backslashes in the prompt must be escaped by a preceding backslash. The prompt string may end in an escaped $ which may be followed by further options for less. By default B<%man%> sets the B<-ix8> options.
uk: Це розбито на три рядки для зручності читання. Для значення дивіться сторінку довідки B<less>(1). Рядок запрошення спочатку оцінюється оболонкою. Усі подвійні лапки, зворотні апострофи та зворотні похилі риски у запрошенні повинні бути екрановані зворотною похилою рискою. Рядок запрошення може закінчуватися екранованим знаком $, який може бути продовжений іншими опціями для less. За замовчуванням B<%man%> встановлює опції B<-ix8>.

source: The $B<MANLESS> environment variable described below may be used to set a default prompt string if none is supplied on the command line.
uk: Змінна середовища $B<MANLESS>, описана нижче, може бути використана для встановлення рядка запрошення за умовчанням, якщо в командному рядку не вказано жодного.

source: When viewing a pure I<ascii>(7) manual page on a 7 bit terminal or terminal emulator, some characters may not display correctly when using the I<latin1>(7) device description with B<GNU> B<nroff>. This option allows pure I<ascii> manual pages to be displayed in I<ascii> with the I<latin1> device. It will not translate any I<latin1> text. The following table shows the translations performed: some parts of it may only be displayed properly when using B<GNU> B<nroff>'s I<latin1>(7) device.
uk: При перегляді чистого сторінки довідки I<ascii>(7) на 7-бітовому терміналі або емуляторі терміналу, деякі символи можуть показуватися неправильно при використанні опису пристрою I<latin1>(7) з B<GNU> B<nroff>. Ця опція дозволяє показувати чисто I<ascii> сторінки довідки в I<ascii> з використанням пристрою I<latin1>. Вона не перекодує будь-який текст I<latin1>. Наступна таблиця показує виконувані перекодування: деякі частини можуть показуватися правильно тільки при використанні пристрою I<latin1>(7) B<GNU> B<nroff>.

source: Description
uk: Опис

source: Octal
uk: Вісімкове

source: continuation hyphen
uk: продовжувальне тире

source: bullet (middle dot)
uk: точка (середня точка)

source: acute accent
uk: гострий акцент

source: multiplication sign
uk: знак множення

source: If the I<latin1> column displays correctly, your terminal may be set up for I<latin1> characters and this option is not necessary. If the I<latin1> and I<ascii> columns are identical, you are reading this page using this option or B<%man%> did not format this page using the I<latin1> device description. If the I<latin1> column is missing or corrupt, you may need to view manual pages with this option.
uk: Якщо стовпець I<latin1> показується коректно, ваш термінал може бути налаштований для символів I<latin1>, і ця опція не потрібна. Якщо стовпці I<latin1> та I<ascii> ідентичні, ви читаєте цю сторінку з використанням цієї опції або B<%man%> не сформував цю сторінку за допомогою опису пристрою I<latin1>. Якщо стовпець I<latin1> відсутній або пошкоджений, можливо, вам потрібно переглядати сторінки довідника з цією опцією.

source: This option is ignored when using options B<-t>, B<-H>, B<-T>, or B<-Z> and may be useless for B<nroff> other than B<GNU's>.
uk: Ця опція ігнорується при використанні опцій B<-t>, B<-H>, B<-T>, або B<-Z> і може бути непридатною для інших B<nroff>, крім B<GNU>.

source: B<-E\ >I<encoding>,\ B<--encoding>=I<encoding>
uk: B<-E\ >I<кодування>,\ B<--encoding>=I<кодування>

source: Generate output for a character encoding other than the default. For backward compatibility, I<encoding> may be an B<nroff> device such as B<ascii>, B<latin1>, or B<utf8> as well as a true character encoding such as B<UTF-8>.
uk: Створити вивід для кодування символів, яке не є за замовчуванням. Для забезпечення сумісності з попередніми версіями, I<кодування> може бути пристроєм B<nroff>, таким як B<ascii>, B<latin1>, або B<utf8>, а також справжнім кодуванням символів, таким як B<UTF-8>.

source: Normally, B<nroff> will automatically hyphenate text at line breaks even in words that do not contain hyphens, if it is necessary to do so to lay out words on a line without excessive spacing. This option disables automatic hyphenation, so words will only be hyphenated if they already contain hyphens.
uk: Зазвичай B<nroff> автоматично переносить текст на нові рядки навіть у словах, які не містять дефісів, якщо це необхідно для розміщення слів у рядку без надмірного простору. Ця опція вимикає автоматичні переноси слів, тому слова будуть переноситися тільки коли вони вже містять дефіси.

source: If you are writing a manual page and simply want to prevent B<nroff> from hyphenating a word at an inappropriate point, do not use this option, but consult the B<nroff> documentation instead; for instance, you can put "\e%" inside a word to indicate that it may be hyphenated at that point, or put "\e%" at the start of a word to prevent it from being hyphenated.
uk: Якщо ви пишете сторінку довідки та просто хочете запобігти переносу слова в небажаному місці у B<nroff>, не використовуйте цю опцію, а зверніться до документації B<nroff>; наприклад, ви можете поставити «\e%» всередині слова, щоб вказати, що воно може бути розбито в тому місці, або поставити «\e%» на початку слова, щоб запобігти його переносу.

source: Normally, B<nroff> will automatically justify text to both margins. This option disables full justification, leaving justified only to the left margin, sometimes called "ragged-right" text.
uk: Зазвичай, B<nroff> автоматично вирівнює текст до обох країв. Ця опція вимикає повне вирівнювання, залишаючи вирівнювання тільки до лівого краю, що іноді називається «вирівнюванням вліво».

source: If you are writing a manual page and simply want to prevent B<nroff> from justifying certain paragraphs, do not use this option, but consult the B<nroff> documentation instead; for instance, you can use the ".na", ".nf", ".fi", and ".ad" requests to temporarily disable adjusting and filling.
uk: Якщо ви пишете сторінку довідки та просто хочете запобігти вирівнюванню певних абзаців у B<nroff>, не використовуйте цю опцію, а зверніться до документації B<nroff>; наприклад, ви можете використовувати запити ".na", ".nf", ".fi" та ".ad", щоб тимчасово вимкнути вирівнювання та заповнення.

source: B<-p\ >I<string>,\ B<--preprocessor=>I<string>
uk: B<-p\ >I<рядок>,\ B<--preprocessor=>I<рядок>

source: Specify the sequence of preprocessors to run before B<nroff> or B<troff>/B<groff>. Not all installations will have a full set of preprocessors. Some of the preprocessors and the letters used to designate them are: B<eqn> (B<e>), B<grap> (B<g>), B<pic> (B<p>), B<tbl> (B<t>), B<vgrind> (B<v>), B<refer> (B<r>). This option overrides the $B<MANROFFSEQ> environment variable. B<%zsoelim%> is always run as the very first preprocessor.
uk: Вкажіть послідовність препроцесорів, які потрібно запустити перед B<nroff> або B<troff>/B<groff>. Не всі інсталяції мають повний набір препроцесорів. Деякі з препроцесорів та літери, що використовуються для їх позначення: B<eqn> (B<e>), B<grap> (B<g>), B<pic> (B<p>), B<tbl> (B<t>), B<vgrind> (B<v>), B<refer> (B<r>). Ця опція перевизначає змінну середовища $B<MANROFFSEQ>. B<%zsoelim%> завжди запускається як перший препроцесор.

source: Use I<%troff%> to format the manual page to stdout. This option is not required in conjunction with B<-H>, B<-T>, or B<-Z>.
uk: Використовуйте I<%troff%>, щоб сформатувати сторінку довідки і вивести до stdout. Ця опція не потрібна разом з B<-H>, B<-T> або B<-Z>.

source: B<-T>[I<device\/>], B<--troff-device>[=I<device\/>]
uk: B<-T>[I<пристрій\/>], B<--troff-device>[=I<пристрій\/>]

source: This option is used to change B<groff> (or possibly B<troff's>) output to be suitable for a device other than the default. It implies B<-t>. Examples (as of groff 1.23.0) include B<dvi>, B<latin1>, B<pdf>, B<ps>, B<utf8>, B<X75> and B<X100>.
uk: Ця опція використовується для зміни виводу B<groff> (або, можливо, B<troff>) так, щоб він був підходив для пристрою, відмінного від пристрою за замовчуванням. Вона передбачає B<-t>. Приклади включають B<dvi>, B<latin1>, B<pdf>, B<ps>, B<utf8>, B<X75> та B<X100>.

source: B<-H>[I<browser\/>], B<--html>[=I<browser\/>]
uk: B<-H>[I<переглядач\/>], B<--html>[=I<переглядач\/>]

source: This option will cause B<groff> to produce HTML output, and will display that output in a web browser. The choice of browser is determined by the optional I<browser> argument if one is provided, by the $B<BROWSER> environment variable, or by a compile-time default if that is unset (usually B<lynx>). This option implies B<-t>, and will only work with B<GNU> B<troff>.
uk: Ця опція призведе до того, що B<groff> вироблятиме HTML-вивід, і показуватиме цей вивід у веб-переглядачі. Вибір переглядача визначається необовʼязковим аргументом I<переглядач>, якщо він наданий, змінною середовища $B<BROWSER>, або зі значення за замовчуванням під час компіляції, якщо воно не встановлене (зазвичай це B<lynx>). Ця опція передбачає B<-t>, і працюватиме тільки з B<GNU> B<troff>.

source: This option displays the output of B<groff> in a graphical window using the B<gxditview> program. The I<dpi> (dots per inch) may be 75, 75-12, 100, or 100-12, defaulting to 75; the -12 variants use a 12-point base font. This option implies B<-T> with the X75, X75-12, X100, or X100-12 device respectively.
uk: Ця опція показує вивід програми B<groff> у графічному вікні за допомогою програми B<gxditview>. Кількість точок на дюйм (dpi) може бути 75, 75-12, 100 або 100-12, за замовчуванням встановлюється значення 75; варіанти з -12 використовують базовий шрифт розміром 12 пунктів. Ця опція передбачає B<-T> з відповідним пристроєм X75, X75-12, X100 або X100-12.

source: B<groff> will run B<troff> and then use an appropriate post-processor to produce output suitable for the chosen device. If I<%troff%> is B<groff>, this option is passed to B<groff> and will suppress the use of a post-processor. It implies B<-t>.
uk: B<groff> запустить B<troff> і потім використає відповідний пост-процесор для створення вихідного файлу, придатного для обраного пристрою. Якщо I<%troff%> є B<groff>, то цей параметр передається до B<groff> і пригнічує використання пост-процесора. Він підтверджує B<-t>.

source: Getting help
uk: Отримання допомоги

source: A child process returned a non-zero exit status.
uk: Дочірній процес повернув статус виходу, відмінний від нуля.

source: At least one of the pages/files/keywords didn't exist or wasn't matched.
uk: Принаймні одна з сторінок/файлів/ключових слів не існувала або не була знайдена.

source: If $B<MANPATH> is set, its value is used as the path to search for manual pages.
uk: Якщо встановлено змінну $B<MANPATH>, її значення використовується як шлях для пошуку сторінок довідки.

source: Every time B<man> invokes the formatter (B<nroff>, B<troff>, or B<groff>), it adds the contents of $B<MANROFFOPT> to the formatter's command line.
uk: Кожного разу, коли B<man> викликає форматувальник (B<nroff>, B<troff>, або B<groff>), він додає вміст $B<MANROFFOPT> до командного рядка форматувальника.

source: For example, B<MANROFFOPT=-P-i> tells the formatter to use italic text (which is only supported by some terminals) rather than underlined text.
uk: Наприклад, B<MANROFFOPT=-P-i> вказує форматувальнику використовувати курсивний текст (який підтримується лише деякими терміналами) замість підкресленого.

source: If $B<MANROFFSEQ> is set, its value is used to determine the set of preprocessors to pass each manual page through. The default preprocessor list is system dependent.
uk: Якщо встановлено змінну $B<MANROFFSEQ>, її значення використовується для визначення набору препроцесорів, через які проходить кожна сторінка довідки. Список препроцесорів за замовчуванням залежить від системи.

source: If $B<MANSECT> is set, its value is a colon-delimited list of sections and it is used to determine which manual sections to search and in what order. The default is "%sections%", unless overridden by the B<SECTION> directive in I<%manpath_config_file%>.
uk: Якщо встановлено $B<MANSECT>, його значення є списком розділів, розділених двокрапками, і використовується для визначення, які розділи довідки потрібно шукати та в якому порядку. За замовчуванням це «%sections%», якщо не перевизначено директивою B<SECTION> у файлі I<%manpath_config_file%>.

source: If $B<MANPAGER> or $B<PAGER> is set ($B<MANPAGER> is used in preference), its value is used as the name of the program used to display the manual page. By default, B<%pager%> is used, falling back to B<%cat%> if B<%pager%> is not found or is not executable.
uk: Якщо встановлено $B<MANPAGER> або $B<PAGER> (переважно використовується $B<MANPAGER>), його значення використовується як назва програми для показу сторінки довідника (гортач). За замовчуванням використовується B<%pager%>, а якщо B<%pager%> не знайдено або він не є виконуваним, то використовується B<%cat%>.

source: If $B<MANLESS> is set, its value will be used as the default prompt string for the B<less> pager, as if it had been passed using the B<-r> option (so any occurrences of the text B<$MAN_PN> will be expanded in the same way). For example, if you want to set the prompt string unconditionally to \(lqmy prompt string\(rq, set $B<MANLESS> to \(oqB<-Psmy\ prompt\ string>\(cq. Using the B<-r> option overrides this environment variable.
uk: Якщо встановлено змінну середовища $B<MANLESS>, її значення буде використовуватися як рядок запрошення за замовчуванням для переглядача B<less>, так само, ніби вона була передана з допомогою опції B<-r> (тому будь-які входження тексту B<$MAN_PN> буде розширено таким же чином). Наприклад, якщо ви хочете однозначно встановити рядок запиту на «my prompt string», встановіть змінну середовища $B<MANLESS> у значення \(oqB<-Psmy\ prompt\ string>\(cq. Використання опції B<-r> перевизначає цю змінну середовища.
